[{"Job": "Software Development Intern", "Company": "Kratos Defense & Security Solutions", "Location": "Lanham, MD", "Detail Info": {"Description": "Job Description\nKratos is seeking a Software Development Intern to join an exciting team of software engineers within the Federal Software Engineering team. The successful candidate will make valuable contributions to dynamic and agile projects; implementing a SecDevOps approach across all phases of the software development lifecycle, to include, design, development, test, and operational support / user feedback.\nQualities we are passionate about in a candidate:\nLoves to automate using scripts;\nDesires to be a valuable contributor within a team environment;\nEmbraces change and is an independent motivator toward one’s improvement;\nMust be self-motivated, be a self-learner, and able to work within a dynamic schedule;\nMust be able to work independently as well as within a team setting on the design, implementation, and maintenance/troubleshooting of new and existing software solutions; primarily within the satellite command and control (c2) domain space; and \nMust be able to organize & report status of tasks being worked and effectively communicate with various team members.\nExperience and Skills\nMust be enrolled in a college / university majoring in a technical field, such as Computer Science, Computer Engineering, Electrical Engineering, or related.\nShows interest in technology and software development\nHas personal drive toward technology\nRelevant projects at work or at home\nAspires to learn and apply new technologies and use them to solve real problems", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Kratos Defense & Security Solutions, Inc. (Nasdaq:KTOS) is a specialized Technology Company providing mission critical products, solutions and services for United States National Security. Kratos' core capabilities are sophisticated engineering, manufacturing and system integration offerings for National Security platforms and programs. Kratos' areas of expertise include Command, Control, Communications, Computing, Combat and Intelligence, Surveillance and Reconnaissance (C5ISR) systems, satellite communications, electronic warfare, unmanned systems, hypersonic systems, directed and high power energy systems, electromagnetic railgun, missile defense, cyber warfare, cybersecurity, information assurance, and critical infrastructure security. Kratos has primarily an engineering and technically oriented work force of approximately 3,100. Substantially all of Kratos' work is performed on a military base, in a secure facility or at a critical infrastructure location.", "Profile": "https://www.monster.com/company/profiles/kratos-defense-and-security-solutions-kratosdefense", "Website": "http://www.kratosdefense.com/", "Industry": "Aerospace and Defense", "Headquarters": "US, , CA", "Company Size": "1,500 to 1,999 employees"}}, {"Job": "Software Engineering Intern", "Company": "Cobham", "Location": "San Diego, CA", "Detail Info": {"Description": "Overview\n\nWe are CAES, a technologically advanced electronics company employing more than 3,600 talented makers, thinkers, innovators, and doers nationwide. We build things that solve challenging problems from deep space to the depths of the ocean. We serve customers in defense, aerospace, security, medical, and industrial markets.\n\nAre you searching for a career with a company that offers challenging, diverse projects and opportunities? Are you looking for a position with a company that is growing and able to offer long-term professional advancement? Searching for a company that values a friendly work environment and that values YOU? Consider CAES. #peoplefocusedmissiondriven\n\nA career with CAES is more than just a job, it is the pathway to a bright future.\n\nSummary:\nThe Software Engineering internship is offered to students in order to educate them on Electrical Manufacturing (RF) Engineering related activities and provide the opportunity for visiting the plant, observing other Engineers performing their work, and looking at how issues are identified and addressed in the manufacturing processes.\nThe internship will be for a period of 3 months during the summer. At the San Diego facility, products are designed and manufactured to protect our ships, aircraft, and most importantly, our country. Join the CAES San Diego team and gain valuable experience while helping protect U.S. and allied forces around the world.\nCAES has hired a number of interns upon their graduation. Our team of engineers are excellent mentors, work with interns to maximize the benefits students can achieve from working in a real manufacturing environment.\n\nResponsibilities\n\nWill be writing software for controls and configuration of equipment - developing test software for FPGA project.\nParticipates in the day to day activities of assigned functional area assisting in the completion of routine and non-routine tasks.\nAssists in applying knowledge to analyze, investigate and resolve problems.\nAssists in developing electronic and hard copy reports, records, diagrams and charts.\nResponsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company.\nExpected to work in a safe manner in accordance with established operating procedures and practices.\nLearn to develop and debug code using National Instruments LabWindows/CVI development environment.\nAdd features and functionality to utilities and applications for a production environment.\nCreate automated scripts that optimize or enhance production testing.\nAdditional tasks and projects, as needed.\n\n\nQualifications\n\nMinimum:\nActively in process of attaining a Bachelor of Science degree in Manufacturing Engineering, Manufacturing Technology, Electrical Engineering, Physics or related discipline\nMust be a US Citizen due to Government Contracts\n\nPreferred:\n\nFamiliar with C, C++, Python, with a focus for academic programming experience\nCommunication skills: ability to receive messages by telephone, in person, electronically and in writing; ask questions and rephrase statements to clarify meaning; ability to read, interpret and comprehend complex written technical publications; communicate quality, integrity and respect in a way that inspires others and encourages innovation and possibilities\nComputer skills: working in networked environment using a Windows and or Windows like interface using PowerPoint, Excel, and Word software programs at an advance level; LabView, AutoCAD, SolidWorks, or exposure to 2D and 3D CAD programming a plus\nMath & Analytical skills: advanced mathematical skills, including statistical analysis; review and compare data to identify inconsistencies and determine priorities; ability to collect, analyze and summarize information to a general understanding; ability to think abstractly and separate complex ideas into simple elements\nTime Management and Organization skills: flexibility and adaptability to changing priorities and assignments; ability to maintain confidentiality; work with the vast array of information gathered during elicitation and analysis and to cope with rapidly changing information\nExcellence Behaviors: remain engaged, proactive and positive even in tough circumstances; own assignment to be fully accountable for their success; align actions, behaviors and conversations to what matters most; ability to work independently and as a team member.\nEmployment Transparency:\n\nCAES is an Equal Opportunity/Affirmative Action Employer and embraces diversity in our employee population. It is the policy of CAES to provide equal opportunity to all qualified applicants and employees without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or genetic information. CAES will refrain from discharging, or otherwise discriminating against, employees or applicants who inquire about, discuss, or disclose their compensation or the compensation of other employees or applicants.\n\nThe EEO is the Law poster is available here and the poster supplement is available here .\n\nThe Pay Transparency Policy is available here .\n\nCAES is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation due to a disability for any part of the employment process, please send an e-mail to CAEScareers@cobhamaes.com and let us know the nature of your request and your contact information.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Cognitive Developer Summer Intern: 2021", "Company": "IBM", "Location": "New York, NY", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart and end dates for this position are summer 2021 (3 months).\n\nBeing a Cognitive Software Developer involves creating learning systems that enable humans and machines to perform better. These systems are designed to create new partnerships between people and machines to augment and scale human expertise in every industry, from healthcare to financial services to education.\n\nWhat You’ll Do:\n• Create and maintain machine learning models with a focus on big data\n•   Work in an Agile, collaborative environment to understand and develop solutions for requirements. This includes designing, coding and testing innovative applications in areas such as machine learning, computational linguistics, Natural Language Processing (NLP), advanced and semantic information search, extraction, induction, classification and exploration.\n•   Assist with implementing, testing and improving algorithms in these areas and proactively identify and file patentable technology\n•   Employ IBM Design Thinking to create products that provide a great user experience along with high performance, security, quality and stability.\n\nWho You Are:\n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.\n•   You thrive on collaboration, working side by side with developers and scientists of all backgrounds and disciplines, and you have very strong verbal and written communication skills.\n•   You have some awareness of knowledge representation and reasoning.\n•   You have a basic understanding of software development and programming in a language such as Java or Python.\n•   You have an interest in, understanding of, or experience with Design Thinking Methodology and Agile Development Methodology.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in Java and/or Python.\n• Basic knowledge of software engineering practices including Agile processes\n• Basic knowledge in Data Mining / Automated Knowledge Acquisition, Representation & Reasoning\n\n\n\nPreferred Technical and Professional Expertise\n• experience in characterization and validation of Cognitive Systems via user studies\n• experience in Machine Learning environments (R, Tensorflow, scikit-learn, Theano, Torch, etc.)\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Marketing Web Developer Internship", "Company": "Stereotaxis, Inc.", "Location": "Saint Louis, MO", "Detail Info": {"Description": "Stereotaxis is a global leader in surgical robotics, headquartered in St. Louis. The company has developed a suite of robotic systems, instruments and information solutions designed to increase the precision and safety of minimally invasive procedures to treat heart arrhythmias. Over 100,000 patients have been treated with Stereotaxis’ robotic systems at over 100 leading hospitals globally.\nMARKETING WEB DEVELOPER INTERNSHIP\nResponsibilities:\n•Work closely with the Marketing team to develop and manage multiple WordPress sites\n•Create high quality responsive page structures from provided design mockups\n•Demonstrate working knowledge and experience using jQuery to produce front-end interactivity  \n•Perform web maintenance tasks to ensure smooth operation and uptime of all sites\n•Participate and contribute during creative and technical team brainstorming sessions\nRole\nPaid internship, 10-40 hours per week, with potential to lead to permanent, full-time position\n \n\nRequired/Desired Qualifications:\n•Javascript proficiency\n•jQuery proficiency\n•Solid HTML / CSS knowledge\n•Wordpress familiarity\n•Basic PHP understanding is a plus\n•Legally authorized to work in the United States.  \nCulture\nStereotaxis values steadfast integrity, intellectual excellence, responsiveness and reliability, and a dedication to constant improvement. We take pride in the positive impact of our work and in building a collaborative and innovative work environment while providing challenging opportunities for teams\nand individuals to grow professionally.\n\n\nClick Here To Apply\nhttp://stereotaxis.hua.hrsmartpe.com/pm_module/cgi-bin/click.cgi?job_id=372&site_id=35", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "2021 Software Engineer Intern", "Company": "Cox Automotive", "Location": "North Hills, NY", "Detail Info": {"Description": "Primary Location: 3400 New Hyde Park Rd, North Hills, NY, USA\nDivision: Cox Automotive\nJob Level: Intern/Co-op\nTravel: No\nSchedule: Full-time\nShift: Day Job\nRequisition Number: 211391\nThis position is a remote / work from home role and can be located anywhere in the United States.\nDealertrack, a brand of Cox Automotive, is currently looking for a Software Engineer Intern to join our Engineering team in North Hills, NY. \nOur Teams: \nAs a part of the Cox Automotive family, Dealer.com helps automotive dealers thrive in today’s digital retailing environment.  Our professionals – technologists, performance consultants, creative designers, customer support experts, and everything in between – deliver a comprehensive suite of digital marketing and operational technology and services to the majority of dealers in the US. We help dealerships optimize their business and help shoppers to shop and buy the way they prefer, through our Dealer.com branded products.  \nThe Dealer Brand & Identity team within Dealer.com Engineering is responsible for the creation and enhancement of the products consumers interact with on our website platform as well as the tools used to manage that experience.  Whether it’s guiding a shopper’s journey to find their perfect vehicle, serving personalized content, or the ability to search the full site for information of interest, our team is responsible for making each experience effortless and successful.  We work closely with our partners to ensure the right work is prioritized to meet the needs of our customers and the consumer by balancing customization against feature enhancement and core product. \n Risk-taking is encouraged here and we reward remarkable results. Collaboration and support are woven into the fabric of everything we do; from 24-hour Hackathons and brain-storming sessions to sprint reviews, you’ll be immersed in an environment that encourages bringing fresh ideas to the table with an innovative mindset.  Giving back to the community is important at Cox Automotive. You will be given time during working hours to volunteer at local charities. \n Job Summary: \nOur Software Engineers are energetic influencers who thrive on designing simple and scalable solutions to complex problems and delivering leading edge software products for our customers. We are looking for exceptionally ambitious and communicative hands-on individuals who are comfortable collaborating within the Agile methodology as part of a cross-functional team, have experience working in fast-paced environments, and who have the passion and skills to take our product offerings to the next level. \nThe Software Engineer Internship will be focused on AWS Cloud migration and client migration for Digital Retailing APIs and plays a role in Agile planning, coding and AWS implementation to achieve migration objectives.  This position is open on the Finance Services Release Train.   \n  Technologies We Use: \n.NET, Python, JavaScript, Oracle, MSMQ, AWS (Lambda, RDS, S3, EC2, SQS/SNS, VPC, Code Build, Code Pipeline, CloudWatch), Splunk, Github \nYour Role: \nWrite testable, readable, maintainable, and efficient code \nImplement REST APIs, services, system tasks and cloud solutions published to both internal and external consumers \nDevEnhance performance and reliability of our current solutions \nCollaborate with developer scrum team members on best practices, code reviews, internal tools and process improvements \nDevelop proficient platform-based knowledge in domain and systems thinking \nQualifications:\nCurrently studying for a degree in Computer Science, Computer Engineering or other Technology degree. For Under Grad students, must be a rising junior or rising senior level (at least 2 years college completed). Graduate students in a technology degree may also apply. \nDemonstrated software engineering experience, specifically CI/CD automation from previous internship/ work experience, or school training/ projects \n\nWhat We Look For: \nAbility to develop and deploy solutions, and to deliver projects in a collaborative environment \nFamiliarity with Cloud-based infrastructure \nAn understanding of database technologies, and logical and physical data modeling \nWillingness to adapt to Agile development methodologies \nWillingness to work with the technologies we use (examples identified above) \nInternship Criteria:\nInternship is not eligible for sponsorship\nPreference is given to rising Seniors, Juniors and Masters students (Dec 2021, May 2022 or May 2023 graduates)\nField of study relevant to role\nAbility to work approximately 10 weeks over summer months\nAbility to work remotely\n#Remote\n\nWho We Are\nAbout Cox Automotive\nThere’s nothing ordinary about Cox Automotive. We are people of every background driven by our passion for mobility, innovation, client success and community outreach. We make buying, selling and owning (or simply using) cars easier for everyone. Touching more than 40,000 clients across five continents, we bring together the best brands and the best teams to propel the automotive industry forward. Some of those team members work for our iconic consumer brands like Autotrader and Kelley Blue Book, while others are creating the future of automotive at industry-facing brands like Dealer.com, Manheim and vAuto.\n About Cox \nWe are the Cox family of businesses. We’ve been making our mark since 1898 by building and evolving world-class businesses, staying true to our values, and encouraging top talent to always look for growth and impact while building a career with us.  Our primary divisions – Cox Communications and Cox Automotive – are driving a new wave of innovation, powering smart cities with powerhouse broadband communications and pioneering greener, more progressive transportation alternatives for individuals and fleet operators.  We’re also expanding into new spaces like cleantech and healthcare to rev up our momentum toward building a better future for the next generation.  We’re looking for the talent today who will be our leaders tomorrow. Sound intriguing? Learn more about where we are today, where we hope you’ll be going with us, and the common purpose that unites us at coxenterprises.com.   \nCox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individual’s age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nStatement to ALL Third-Party Agencies and Similar Organizations:  Cox accepts resumes only from agencies with which we formally engage their services.   Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Systems Application Engineer Intern", "Company": "Leading Internet / Online Media Company", "Location": "Van Nuys, CA", "Detail Info": {"Description": "Responsibilities\nJOB SUMMARY: This is an intern position that will provide systems application support to our channel partners, consultants, Reps and prospective users within the Systems Business Unit. Primary duties are first-response customer phone support and basic software/hardware troubleshooting. This position requires broad skills and knowledge of QSCs Systems products, including Q-SYS Level 1 certification. The successful candidate must be able to work professionally with all levels of employees and interface well with external professionals, distributors, Reps and dealers.\nEDUCATION AND EXPERIENCE: - IT networking experience and AV experience and a passion to learn are highly desirable - Experience with AutoCAD and Customer Requirement Management (CRM) software, like Salesforce, are highly desirable - Possess strong computer skills, including proficiency with Microsoft Office (Outlook, Word, Excel & PPT) - Strong collaboration skills with Tier 2 Team, Customer Service Team and cross functional teams - Ability to manage multiple tasks simultaneously while meeting specific deadlines - Good written, verbal & presentation skills - Creative, motivated, reliable, quick learner and possess a natural curiosity with network based products - Excellent interpersonal & communication skills\nDUTIES AND RESPONSIBILITIES:\nProvide first-response phone Application Support on network products\nCreate ticket in Salesforce to track escalated cases for software and hardware issues\nDeliver basic troubleshooting and diagnostics of network systems and Q-SYS products. Basic technical support topics include the below: o Acoustic Echo Cancellation (AEC) signal flow and gain structure o Support of license products o Gain structure basic setup and diagnostics o Support of Q-SYS networking best-practice and troubleshooting o Basic audio, video and Q-SYS Control support\nDeliver call-handling best-practices in a call-center environment\nSupport special projects as assigned\nDeliver an exceptional customer experience to enforce QSCs strong brand presence in the Systems market", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "2021 Ford Motor Credit Company- Software Engineering Intern", "Company": "Ford Motor Company", "Location": "Dearborn, MI", "Detail Info": {"Description": "The people of Ford Motor Credit Company have a 60-year commitment to helping put people behind the wheels of great Ford and Lincoln vehicles. By partnering with dealerships, we provide financing, personalized service, and professional expertise to five thousand dealers and more than four million customers in over 100 countries around the world. The software product organization within Ford Credit seeks to deeply understand our customer so that we may provide digital solutions that improve their ability to finance and own Ford and Lincoln vehicles.\n\nPosition Duties\nFord Motor Credit Company's Information Technology's 10-week summer internship isfor college students pursuinga bachelor's degree in computer science, Software Engineering or a related field that employs software development skills.\n\nWe seek to provide challenging and engaging internship assignments such that you will maximize your learning and enjoyment of your time with us. Our engineers develop cloud native web, mobile and API solutions. Upon starting your internship, you will be placed on a team and be given the context of a problem to solve for our customer. You will also be provided mentorship from a senior engineer within the organization to help guide you through your internship.\nMinimum Requirements\nCandidatesmust have completed at least one year of college.\nPursuing a degree in Computer Science, Software Engineering or a related field that employs software development skills.\nCandidates must have a minimum GPA of 3.0 or higher on a 4.0 scale.\nAnalytical and creative problem-solving situations\nDrive to research, learn, andimplement new technologies.\nWork well in asmall team and be flexible to work on any aspect of theproject as needed.\nStrong verbal and written communication skills\nPreferred Requirements for Candidates:\nExperience with cloud technologies\nExperience developing in one of the following languages:\nWeb: JavaScript or TypeScript\nMobile: Android orSwift/Objective-C\nAPI: Java, Kotlin, Ruby, Python, Golang, C#\n\nWe believe that freedom of movement drives human progress. Ford Information Technology (IT) is shaping the future of mobility by redefining the transportation landscape, enhancing thecustomer experience and improving people's lives.Join the Ford family as we change the way the world moves.\nCandidates for positions with Ford Motor Company must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.\n\nBy choice, we are an Equal Opportunity Employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Cognitive Developer Summer Intern: 2021", "Company": "IBM", "Location": "Raleigh, NC", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart and end dates for this position are summer 2021 (3 months).\n\nBeing a Cognitive Software Developer involves creating learning systems that enable humans and machines to perform better. These systems are designed to create new partnerships between people and machines to augment and scale human expertise in every industry, from healthcare to financial services to education.\n\nWhat You’ll Do:\n• Create and maintain machine learning models with a focus on big data\n•   Work in an Agile, collaborative environment to understand and develop solutions for requirements. This includes designing, coding and testing innovative applications in areas such as machine learning, computational linguistics, Natural Language Processing (NLP), advanced and semantic information search, extraction, induction, classification and exploration.\n•   Assist with implementing, testing and improving algorithms in these areas and proactively identify and file patentable technology\n•   Employ IBM Design Thinking to create products that provide a great user experience along with high performance, security, quality and stability.\n\nWho You Are:\n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.\n•   You thrive on collaboration, working side by side with developers and scientists of all backgrounds and disciplines, and you have very strong verbal and written communication skills.\n•   You have some awareness of knowledge representation and reasoning.\n•   You have a basic understanding of software development and programming in a language such as Java or Python.\n•   You have an interest in, understanding of, or experience with Design Thinking Methodology and Agile Development Methodology.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in Java and/or Python.\n• Basic knowledge of software engineering practices including Agile processes\n• Basic knowledge in Data Mining / Automated Knowledge Acquisition, Representation & Reasoning\n\n\n\nPreferred Technical and Professional Expertise\n• experience in characterization and validation of Cognitive Systems via user studies\n• experience in Machine Learning environments (R, Tensorflow, scikit-learn, Theano, Torch, etc.)\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "2021 Software Engineer Intern", "Company": "Cox Automotive", "Location": "Atlanta, GA", "Detail Info": {"Description": "Primary Location: 1001 Summit Blvd, Atlanta, GA, USA\nDivision: Cox Automotive\nJob Level: Intern/Co-op\nTravel: No\nSchedule: Full-time\nShift: Day Job\nRequisition Number: 211390\nThis position is a remote / work from home role and can be located anywhere in the United States.\nCox Automotive, is currently looking to hire a Software Engineer Intern.  \nAt Cox Automotive we offer the chance to do your best work and to help lead the digital revolution of the auto industry. Our Software Delivery teams are influencers who are redefining the way the world buys, sells, owns and uses cars.  Collaboration is woven into the fabric of everything we do; from 24-hour Hackathons to sprint reviews and scrum teams, you’ll be immersed in an environment that nurtures individualism, creative problem-solving, and intellect. \nAs a Software Engineer Intern, you will partner with Sr. Engineers, Product Teams, and Leadership to help drive our next generation of technical solutions.  We work across multiple tech stacks and platforms, and with more than 25 brands under our belt – Autotrader, Dealertrack, Kelly Blue Book, vAuto, Xtime and more, you’ll have plenty of opportunity to flex your brainpower and grow your career. \nFor this engagement we are seeking an individual to help us refine our release management process, bringing automation to tracking the alignment of the development work our teams are outputting to the actual code deployments and feature releases. \nWe’re looking for great brains and great spirits to join our team today. Apply with us and let’s connect! \nQualifications:\nCurrently studying for a degree in Computer Science, Computer Engineering or other Technology degree. For Under Grad students, must be a rising junior or rising senior level (at least 2 years college completed). Graduate students in a technology degree may also apply. \nKnowledge in Python, Java, JavaScript, C#, or .Net \nDemonstrated software engineering experience, specifically CI/CD automation from previous internship/ work experience, or school training/ projects \n Internship Criteria:\nInternship is not eligible for sponsorship\nPreference is given to rising Seniors, Juniors and Masters students (Dec 2021, May 2022 or May 2023 graduates)\nField of study relevant to role\nAbility to work approximately 10 weeks over summer months\nAbility to work remotely\n#Remote\n\nWho We Are\nAbout Cox Automotive\nThere’s nothing ordinary about Cox Automotive. We are people of every background driven by our passion for mobility, innovation, client success and community outreach. We make buying, selling and owning (or simply using) cars easier for everyone. Touching more than 40,000 clients across five continents, we bring together the best brands and the best teams to propel the automotive industry forward. Some of those team members work for our iconic consumer brands like Autotrader and Kelley Blue Book, while others are creating the future of automotive at industry-facing brands like Dealer.com, Manheim and vAuto.\n About Cox \nWe are the Cox family of businesses. We’ve been making our mark since 1898 by building and evolving world-class businesses, staying true to our values, and encouraging top talent to always look for growth and impact while building a career with us.  Our primary divisions – Cox Communications and Cox Automotive – are driving a new wave of innovation, powering smart cities with powerhouse broadband communications and pioneering greener, more progressive transportation alternatives for individuals and fleet operators.  We’re also expanding into new spaces like cleantech and healthcare to rev up our momentum toward building a better future for the next generation.  We’re looking for the talent today who will be our leaders tomorrow. Sound intriguing? Learn more about where we are today, where we hope you’ll be going with us, and the common purpose that unites us at coxenterprises.com.   \nCox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individual’s age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nStatement to ALL Third-Party Agencies and Similar Organizations:  Cox accepts resumes only from agencies with which we formally engage their services.   Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Intern App / Website Development Engineer", "Company": "Leading Internet / Online Media Company", "Location": "Oceanside, CA", "Detail Info": {"Description": "Responsibilities\nAbout this Job At Kuma Holdings LLC, we truly believe in reinventing systems and creative disruptive technologies. As a Mobile Engineer intern, you will be involved in building elegant products on world-class technologies that could potentially improve the lives of millions of people. You will play an important role in designing and developing features for our iOS app and web interface and be a part of product discussions from start to finish. We are looking for self-starting engineers with strong experience developing applications on the iPhone or iPad using the iOS SDK or other current software languages. If you are interested in being a part of a early stage disruptive technology that incorporates a blockchain tracking system, then we look forward to hearing from you. Responsibilities: Work closely with our product and design teams to create a unique customized experience for the iOS platform. Implement custom native user interfaces using the latest iOS programming techniques. Analyze and optimize UI & back-end application code for interfacing with our current platform. At the end of the internship, present to management and have option to continue full time Requirements: Bachelors degree in Computer Science or related field, or at least 3years completed towards a Bachelors degree, or full-time Masters degree student Object-oriented software development experience Experience building applications for iPhone or iPad Experience with multithreading programming Experience with Rest Web Services and JSON or simialar Experience writing unit tests and testable code Excellent problem solving, critical thinking and communications skills About Kuma Holdings LLC. Kuma Holdings is an incubator company focusing on disruptive consumer technologies.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Technology Professional", "Company": "PSEG", "Location": "Newark, NJ", "Detail Info": {"Description": "Requisition ID:  65477 \n\nJob Function/Category:  Information Technology \n\nEmployment Type:  Non-Exempt Full Time \n\nThis is an exciting time to be joining PSEG. Our commitments, which include safety, integrity, customer focus, and diversity & inclusion, are the fabric of our culture and help drive the success of our business. We are fortunate to have an outstanding workforce of diverse and highly skilled talent who move us forward in our operational excellence journey.  PSEG has more than 12,000 employees who are dedicated to the communities we serve and embody our vision: People providing Safe, Reliable, Economic and Greener Energy. Job Summary\n\nPSEG is looking for talented technology professionals to join our team. Our vision is to power the digital future of PSEG. We are partners with the business and we are driving business outcomes through innovative use of technology.\n\nJob Responsibilities\n\nOur Technology Professional role is an entry level role that provides the opportunity to be involved in meaningful work/projects throughout the Information Technology organization. This position prepares candidates for advanced information technology positions through challenging assignments, and allows them to develop their skills and experience in emerging technologies. This position is involved in the full systems life cycle and responsible for designing, coding, testing, implementing and supporting application software and systems. This Position works closely with Business Analysts, Product Owners and Group Product Managers to understand the business requirements that drive the analysis and physical design of technical solutions.\n\nJob Specific Qualifications\n\n• Bachelor's degree in Information Systems, Computer Science, Information/Computer Security, Engineering or a related discipline i.e. STEM.\n• Level of experience required ranges from internship to 4 years of relevant experience within the IT field or an industry with reliance on technical expertise.\n• Overall strong technical proficiency in information technology/computer disciplines.\n• Strong MS Office skills (i.e. Excel, Word, PowerPoint and Access)\n• Experience working with or related coursework in .NET, HTML, SQL, Java, Java scripting or Object Oriented Design.\n• Self-starter with the demonstrated ability to learn new technical concepts quickly.\n• Detail oriented and demonstrated strong analytical and problem solving skills.\n• Good written and oral communication skills.\n• Good interpersonal skills and the ability to work effectively with clients, IT management and staff.\n\nOther:\n• PSEG will not offer visa sponsorship in connection with these positions.\n• Candidate must have a valid driver's license and be willing to travel within the state and to PSEG LI locations.\n\nDisclaimer\n\nCertain positions at the Company may require you to have access to Part 810-Controlled Information.  Under the law, the Company is limited in who it can share this information with and in certain circumstances it is necessary to obtain specific authorization before the Company can share this information.  Accordingly, if the position does require access to this information, you must complete a 10 CFR Part 810 Export Control Compliance Nationality Request Form, a copy of which will be provided to you by Talent Acquisition if an offer is made.  If there is a need for specific authorization, due to the time it takes to obtain authorization from the government, we will likely not be able to further proceed with an offer.As an employee of PSE&G or PSEG Long Island, you should be aware that during storm restoration efforts, you may be required to perform functions outside of your routine duties and on a schedule that may be different from normal operations.\n\nThis site ( http://www.pseg.com ) is strictly for candidates who are not currently PSEG employees. PSEG employees must apply for jobs internally through empower which can be accessed through the mypseg homepage by clicking on the employee center tab, then under the empower header, choose careers.\n\nBusiness needs may cause PSEG to cancel or delay filling position at any time during the selection process.\n\nCertain positions at the Company may require you to have access to Part 810-Controlled Information.  Under the law, the Company is limited in who it can share this information with and in certain circumstances it is necessary to obtain specific authorization before the Company can share this information.  Accordingly, if the position does require access to this information, you must complete a 10 CFR Part 810 Export Control Compliance Nationality Request Form, a copy of which will be provided to you by Talent Acquisition if an offer is made.  If there is a need for specific authorization, due to the time it takes to obtain authorization from the government, we will likely not be able to further proceed with an offer.\n\nPublic Service Enterprise Group (PSEG) is an equal opportunity employer, dedicated to a policy of non-discrimination in employment, including the hiring process, based on any legal protected characteristic. Legally protected characteristics included, race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, or veteran status or any other characteristic protected by federal, state, or local law in locations where PSEG employs individuals.\n\nNeed to request an accommodation?\n\nIf you have a disability and need assistance submitting your resume, applying for a position or registering for a test, please call 973-430-3845. Any information provided regarding a disability will be kept strictly confidential and will not be shared with anyone involved in making a hiring decision.\n\nNearest Major Market: Newark\nNearest Secondary Market: New York City\nJob Segment: Engineer, Developer, Intern, Information Systems, Computer Science, Engineering, Technology, Entry Level", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "The energy of Public Service Enterprise Group (PSEG) is our people! We offer employees opportunities to build careers working with skilled and dedicated people on some of the most important challenges of our time. We respect all aspects of diversity, valuing others' strengths, perspectives, and approaches. PSEG, a diversified energy holding company with over $28 billion in assets, is one of the nation's leading wholesale energy producers and most reliable electric and gas transmission and delivery utilities. PSEG has received numerous recognition awards for performance, safety, community support, diversity and the environment.", "Profile": "https://www.monster.com/company/profiles/pseg-pseg", "Website": "https://www.pseg.com/home/index.jsp", "Industry": "Energy and Utilities", "Headquarters": "US", "Founded": "1903", "Company Size": "10,000 employees or more"}}, {"Job": "Cognitive Developer Summer Intern: 2021", "Company": "IBM", "Location": "Austin, TX", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart and end dates for this position are summer 2021 (3 months).\n\nBeing a Cognitive Software Developer involves creating learning systems that enable humans and machines to perform better. These systems are designed to create new partnerships between people and machines to augment and scale human expertise in every industry, from healthcare to financial services to education.\n\nWhat You’ll Do:\n• Create and maintain machine learning models with a focus on big data\n•   Work in an Agile, collaborative environment to understand and develop solutions for requirements. This includes designing, coding and testing innovative applications in areas such as machine learning, computational linguistics, Natural Language Processing (NLP), advanced and semantic information search, extraction, induction, classification and exploration.\n•   Assist with implementing, testing and improving algorithms in these areas and proactively identify and file patentable technology\n•   Employ IBM Design Thinking to create products that provide a great user experience along with high performance, security, quality and stability.\n\nWho You Are:\n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.\n•   You thrive on collaboration, working side by side with developers and scientists of all backgrounds and disciplines, and you have very strong verbal and written communication skills.\n•   You have some awareness of knowledge representation and reasoning.\n•   You have a basic understanding of software development and programming in a language such as Java or Python.\n•   You have an interest in, understanding of, or experience with Design Thinking Methodology and Agile Development Methodology.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in Java and/or Python.\n• Basic knowledge of software engineering practices including Agile processes\n• Basic knowledge in Data Mining / Automated Knowledge Acquisition, Representation & Reasoning\n\n\n\nPreferred Technical and Professional Expertise\n• experience in characterization and validation of Cognitive Systems via user studies\n• experience in Machine Learning environments (R, Tensorflow, scikit-learn, Theano, Torch, etc.)\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "2021 EPM Full Stack Developer Intern", "Company": "IBM", "Location": "New York, NY", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nAs an Enterprise Performance Management intern you will work with a well-rounded team of fellow interns to own a project throughout the internship. You will be paired with experienced architects and developers for guidance daily to guide you in the architecture and production ready code practices. Placement as an intern will be within one of the following functional groups in EPM - Delivery, Security, Finance & Planning, or Support.\n\nResponsibilities Include:\nWork with stakeholders and others in a multidisciplinary team to define requirements and develop the end to end solution\nBe responsible for the full DevOps implementation of Production ready code from inception through delivery and production readiness.\nPractice the Agile methodology of software delivery, where your team will completely rely on all team members. Therefore, every team member will be performing all tasks in the day in the life of software delivery. This includes daily stand-ups, iteration planning, and retrospectives.\n\n\n\n\nRequired Technical and Professional Expertise\nCurrently pursuing a college degree in Computer Science or in another closely related degree program.\nKnowledge and/or experience in software development.\n\n\n\nPreferred Technical and Professional Expertise\nFull-stack development experience (using frameworks such as React, AngularJS and NodeJS).\nHands on experience with object-oriented programming languages (Python, Scala & JavaScript).\nExperience with Cloud base architecture (for example: IBM Cloud or AWS development).\nExperience with DevOps.\nExposure to Agile development methodologies.\n\n\n\nAbout Business Unit\nThe IBM Finance organization is responsible for driving enterprise performance and transformation.  We are the financial stewards of IBM, delivering IBM’s financial strategy, developing new business models, and mitigating enterprise risk. Do you have a passion for creating business value? Join our team in accounting, financial planning, pricing, business controls, tax, treasury, business development (acquisitions & divestitures), and global financing.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nIBM will not be providing visa sponsorship for this position now or in the future.  Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "2021 EPM Full Stack Developer Intern", "Company": "IBM", "Location": "Austin, TX", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nAs an Enterprise Performance Management intern you will work with a well-rounded team of fellow interns to own a project throughout the internship. You will be paired with experienced architects and developers for guidance daily to guide you in the architecture and production ready code practices. Placement as an intern will be within one of the following functional groups in EPM - Delivery, Security, Finance & Planning, or Support.\n\nResponsibilities Include:\nWork with stakeholders and others in a multidisciplinary team to define requirements and develop the end to end solution\nBe responsible for the full DevOps implementation of Production ready code from inception through delivery and production readiness.\nPractice the Agile methodology of software delivery, where your team will completely rely on all team members. Therefore, every team member will be performing all tasks in the day in the life of software delivery. This includes daily stand-ups, iteration planning, and retrospectives.\n\n\n\n\nRequired Technical and Professional Expertise\nCurrently pursuing a college degree in Computer Science or in another closely related degree program.\nKnowledge and/or experience in software development.\n\n\n\nPreferred Technical and Professional Expertise\nFull-stack development experience (using frameworks such as React, AngularJS and NodeJS).\nHands on experience with object-oriented programming languages (Python, Scala & JavaScript).\nExperience with Cloud base architecture (for example: IBM Cloud or AWS development).\nExperience with DevOps.\nExposure to Agile development methodologies.\n\n\n\nAbout Business Unit\nThe IBM Finance organization is responsible for driving enterprise performance and transformation.  We are the financial stewards of IBM, delivering IBM’s financial strategy, developing new business models, and mitigating enterprise risk. Do you have a passion for creating business value? Join our team in accounting, financial planning, pricing, business controls, tax, treasury, business development (acquisitions & divestitures), and global financing.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nIBM will not be providing visa sponsorship for this position now or in the future.  Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "2021 EPM Full Stack Developer Intern", "Company": "IBM", "Location": "Raleigh, NC", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nAs an Enterprise Performance Management intern you will work with a well-rounded team of fellow interns to own a project throughout the internship. You will be paired with experienced architects and developers for guidance daily to guide you in the architecture and production ready code practices. Placement as an intern will be within one of the following functional groups in EPM - Delivery, Security, Finance & Planning, or Support.\n\nResponsibilities Include:\nWork with stakeholders and others in a multidisciplinary team to define requirements and develop the end to end solution\nBe responsible for the full DevOps implementation of Production ready code from inception through delivery and production readiness.\nPractice the Agile methodology of software delivery, where your team will completely rely on all team members. Therefore, every team member will be performing all tasks in the day in the life of software delivery. This includes daily stand-ups, iteration planning, and retrospectives.\n\n\n\n\nRequired Technical and Professional Expertise\nCurrently pursuing a college degree in Computer Science or in another closely related degree program.\nKnowledge and/or experience in software development.\n\n\n\nPreferred Technical and Professional Expertise\nFull-stack development experience (using frameworks such as React, AngularJS and NodeJS).\nHands on experience with object-oriented programming languages (Python, Scala & JavaScript).\nExperience with Cloud base architecture (for example: IBM Cloud or AWS development).\nExperience with DevOps.\nExposure to Agile development methodologies.\n\n\n\nAbout Business Unit\nThe IBM Finance organization is responsible for driving enterprise performance and transformation.  We are the financial stewards of IBM, delivering IBM’s financial strategy, developing new business models, and mitigating enterprise risk. Do you have a passion for creating business value? Join our team in accounting, financial planning, pricing, business controls, tax, treasury, business development (acquisitions & divestitures), and global financing.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nIBM will not be providing visa sponsorship for this position now or in the future.  Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Back End Developer Summer Intern: 2021", "Company": "IBM", "Location": "New York, NY", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart dates for this position are Summer 2021\n\nAs a Back End Developer Summer Intern you:\n• Are experienced with client-server architectures, networking protocols, application development, and using databases.  \n• Have experience using and developing APIs.  \n• Understand user and system requirements  \n• Have an understanding of, or experience with, Agile development methodology.\n \nWhat You’ll Do:  \n•   You’ll work in a dynamic, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.    \n•   You’ll employ IBM’s Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability.    \n•   Design and code servers, services, applications and databases that are reusable, scalable and meet critical architecture goals.    \n•   Create Application Programming Interfaces (APIs) that are clean, well-documented, and easy to use.    \n•   Create and configure Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) applications.  Design and implement large scale systems and Service Oriented Architectures (SOA) that enable continuous delivery.  \nWho You Are:   \n•   You are highly motivated and have a passion for creating and supporting great products.    \n•   You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.    \n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.  \n•   You have a basic understanding of software development and programming languages.  \n•   You have the ability to learn new skills quickly and use the skills efficiently.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in one or more of the following technology areas: C++, C, Java, Ruby, Python, Perl, SQL\n• Basic knowledge of operating systems and how they work (i.e. Operating systems courses); Container technologies; Internet Services; and/or Managed Services\n• Understanding of user and system requirements\n• Have an interest in, understanding of, or experience with Agile development methodology\n\n\n\nPreferred Technical and Professional Expertise\n•  Skilled in working with Linux Kernel, scheduler, memory management system, device drivers, hardware architectures\n•  Familiarity with APIs\n•  Experience working with severs, applications and databases\n\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Back End Developer Summer Intern: 2021", "Company": "IBM", "Location": "Raleigh, NC", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart dates for this position are Summer 2021\n\nAs a Back End Developer Summer Intern you:\n• Are experienced with client-server architectures, networking protocols, application development, and using databases.  \n• Have experience using and developing APIs.  \n• Understand user and system requirements  \n• Have an understanding of, or experience with, Agile development methodology.\n \nWhat You’ll Do:  \n•   You’ll work in a dynamic, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.    \n•   You’ll employ IBM’s Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability.    \n•   Design and code servers, services, applications and databases that are reusable, scalable and meet critical architecture goals.    \n•   Create Application Programming Interfaces (APIs) that are clean, well-documented, and easy to use.    \n•   Create and configure Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) applications.  Design and implement large scale systems and Service Oriented Architectures (SOA) that enable continuous delivery.  \nWho You Are:   \n•   You are highly motivated and have a passion for creating and supporting great products.    \n•   You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.    \n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.  \n•   You have a basic understanding of software development and programming languages.  \n•   You have the ability to learn new skills quickly and use the skills efficiently.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in one or more of the following technology areas: C++, C, Java, Ruby, Python, Perl, SQL\n• Basic knowledge of operating systems and how they work (i.e. Operating systems courses); Container technologies; Internet Services; and/or Managed Services\n• Understanding of user and system requirements\n• Have an interest in, understanding of, or experience with Agile development methodology\n\n\n\nPreferred Technical and Professional Expertise\n•  Skilled in working with Linux Kernel, scheduler, memory management system, device drivers, hardware architectures\n•  Familiarity with APIs\n•  Experience working with severs, applications and databases\n\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Back End Developer Summer Intern: 2021", "Company": "IBM", "Location": "Austin, TX", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\nStart dates for this position are Summer 2021\n\nAs a Back End Developer Summer Intern you:\n• Are experienced with client-server architectures, networking protocols, application development, and using databases.  \n• Have experience using and developing APIs.  \n• Understand user and system requirements  \n• Have an understanding of, or experience with, Agile development methodology.\n \nWhat You’ll Do:  \n•   You’ll work in a dynamic, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.    \n•   You’ll employ IBM’s Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability.    \n•   Design and code servers, services, applications and databases that are reusable, scalable and meet critical architecture goals.    \n•   Create Application Programming Interfaces (APIs) that are clean, well-documented, and easy to use.    \n•   Create and configure Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) applications.  Design and implement large scale systems and Service Oriented Architectures (SOA) that enable continuous delivery.  \nWho You Are:   \n•   You are highly motivated and have a passion for creating and supporting great products.    \n•   You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.    \n•   You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.  \n•   You have a basic understanding of software development and programming languages.  \n•   You have the ability to learn new skills quickly and use the skills efficiently.\n\nThese are office based positions in IBM locations including the following. Opportunities in these locations will vary based on demand & will be deleted as filled:\nAZ - Tucson\nCA - Costa Mesa, Emeryville, Foster City, San Francisco, San Jose\nCT - Southbury\nGA - Brookhaven, Sandy Springs\nKS - Leawood\nMA - Andover, Cambridge, Littleton\nMN - Rochester\nNY - Armonk, NYC, Poughkeepsie, Yorktown Heights\nNC - Charlotte, Research Triangle Park\nOH - Columbus\nPA - Blue Bell, Pittsburgh\nTX - Austin, Dallas, Houston\nVA - Herndon\nVT - Essex Junction\nWI - Madison\n\n\n\nRequired Technical and Professional Expertise\n• Basic knowledge in one or more of the following technology areas: C++, C, Java, Ruby, Python, Perl, SQL\n• Basic knowledge of operating systems and how they work (i.e. Operating systems courses); Container technologies; Internet Services; and/or Managed Services\n• Understanding of user and system requirements\n• Have an interest in, understanding of, or experience with Agile development methodology\n\n\n\nPreferred Technical and Professional Expertise\n•  Skilled in working with Linux Kernel, scheduler, memory management system, device drivers, hardware architectures\n•  Familiarity with APIs\n•  Experience working with severs, applications and databases\n\n\n\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Intern with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "ummer 2021 - Customer Technology; Energy Cloud Intern", "Company": "PSEG", "Location": "Newark, NJ", "Detail Info": {"Description": "Requisition ID:  65329 \n\nJob Function/Category:  University Recruiting \n\nEmployment Type:  Non-Exempt Part Time \n\nThis is an exciting time to be joining PSEG. Our commitments, which include safety, integrity, customer focus, and diversity & inclusion, are the fabric of our culture and help drive the success of our business. We are fortunate to have an outstanding workforce of diverse and highly skilled talent who move us forward in our operational excellence journey.  PSEG has more than 12,000 employees who are dedicated to the communities we serve and embody our vision: People providing Safe, Reliable, Economic and Greener Energy. PSEG is seeking a Customer Technology Intern. The Customer Technology team implements system enhancements to customer-facing technologies such as web self-service, mobile web, My Alerts, Storm Center mobile app, and CRM. Work will vary based on the status of projects that are in motion during that time. Possible assignments include assisting team members with testing system enhancements or changes, researching and benchmarking other companies' use of similar technologies, writing user stories, and conducting web usability studies. Interns may be asked to run reports and communicate the results.\n\nCandidates need to be able to meet deadlines, work collaboratively across the business, juggle competing priorities, operate independently while knowing when to ask for help or guidance, and view all work from a customer's perspective. Candidates should have an interest in, and comfort with, website design, e-commerce, and mobile technology. Being technically savvy is an advantage. Strong communication skills are critical, particularly written communication, and candidates with direct customer service experience are desired. Candidates should have proficiency in Microsoft Office products such as Excel, Word, and PowerPoint.\n\nRequired Education/Skills: The successful candidate (s) must be actively pursuing a Bachelor's Degree from an accredited institution in Business, Communications, CIS or related major and an anticipated graduation date between December 2021 and May 2022. PSEG recognizes institutions of higher education, which are accredited by the Council for Higher Education Accreditation or equivalent.\n\nAll PSEG internship roles are paid at an hourly rate, however there are no benefits associated with these positions We are targeting: Currently enrolled students staying in the NJ/NY/PA metro area for the duration of the internship and able to commute to the assigned work location. Housing, transportation, immigration support will not be provided in association with these positions. As an employee of PSE&G or PSEG Long Island, you should be aware that during storm restoration efforts, you may be required to perform functions outside of your routine duties and on a schedule that may be different from normal operations.\n\nThis site ( http://www.pseg.com ) is strictly for candidates who are not currently PSEG employees. PSEG employees must apply for jobs internally through empower which can be accessed through the mypseg homepage by clicking on the employee center tab, then under the empower header, choose careers.\n\nBusiness needs may cause PSEG to cancel or delay filling position at any time during the selection process.\n\nCertain positions at the Company may require you to have access to Part 810-Controlled Information.  Under the law, the Company is limited in who it can share this information with and in certain circumstances it is necessary to obtain specific authorization before the Company can share this information.  Accordingly, if the position does require access to this information, you must complete a 10 CFR Part 810 Export Control Compliance Nationality Request Form, a copy of which will be provided to you by Talent Acquisition if an offer is made.  If there is a need for specific authorization, due to the time it takes to obtain authorization from the government, we will likely not be able to further proceed with an offer.\n\nPublic Service Enterprise Group (PSEG) is an equal opportunity employer, dedicated to a policy of non-discrimination in employment, including the hiring process, based on any legal protected characteristic. Legally protected characteristics included, race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, or veteran status or any other characteristic protected by federal, state, or local law in locations where PSEG employs individuals.\n\nNeed to request an accommodation?\n\nIf you have a disability and need assistance submitting your resume, applying for a position or registering for a test, please call 973-430-3845. Any information provided regarding a disability will be kept strictly confidential and will not be shared with anyone involved in making a hiring decision.\n\nNearest Major Market: Newark\nNearest Secondary Market: New York City\nJob Segment: Cloud, Intern, Compliance, CRM, Energy, Technology, Entry Level, Legal", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "The energy of Public Service Enterprise Group (PSEG) is our people! We offer employees opportunities to build careers working with skilled and dedicated people on some of the most important challenges of our time. We respect all aspects of diversity, valuing others' strengths, perspectives, and approaches. PSEG, a diversified energy holding company with over $28 billion in assets, is one of the nation's leading wholesale energy producers and most reliable electric and gas transmission and delivery utilities. PSEG has received numerous recognition awards for performance, safety, community support, diversity and the environment.", "Profile": "https://www.monster.com/company/profiles/pseg-pseg", "Website": "https://www.pseg.com/home/index.jsp", "Industry": "Energy and Utilities", "Headquarters": "US", "Founded": "1903", "Company Size": "10,000 employees or more"}}, {"Job": "Consulting Intern – Technology – Software Engineering", "Company": "Leading Internet / Online Media Company", "Location": "Chicago, IL", "Detail Info": {"Description": "Ready for the next step on your career journey?\nWest Monroe is seeking interns for Summer 2021 in our Software Engineering (SE) Practice. Technology interns work in a variety of industries including private equity, finance, healthcare, insurance, energy and many more. You will work directly with clients to understand their business needs and strategies to deliver technical solutions ranging from bond trading platforms to mobile applications.\nAt West Monroe, we offer exciting career opportunities for people who seek challenges and manage the pace of their own career, while learning and being mentored by talented and seasoned professionals from the consulting industry. You will have an opportunity to interact and work with senior-level executives and take on challenging roles at an early stage in your career.\nInterns in our Software Engineering practice have these primary responsibilities\nFunctional Responsibilities:\nCollaborate with clients to understand their business needs\nCollaborate with team members to design and develop software applications\nUse an Agile approach to iteratively deliver production-ready applications\nYou will learn & work with several of our core technologies: (previous experience is not required)\nBack-end: C#/.NET Core, Java\nFront-end: HTML5, CSS3, JavaScript, Angular, React, VueJS\nMobile: Xamarin, Swift, Android\nDatabase: SQL Server, MongoDB, PostgreSQL\nPlatforms: SharePoint, Mulesoft, Boomi\nCloud: Microsoft Azure, Amazon Web Services (AWS)\nYou will learn & work with several of the following patterns & tools: (previous experience is not required)\nPatterns: MVC, MVVM, Service Oriented Architecture (SOA), REST\nSource Control: Git, Azure DevOps\nDevOps Tooling: Terraform, Docker, Kubernetes\nPackage Management: Bower, NPM, NuGet\nTesting: XUnit, MSTest, Jasmine, Karma\nInternal Responsibilities:\nProblem-solvers with natural innovative and analytical skills\nExcellent leaders with strong communication (written and oral), interpersonal and organizational skills\nAble to efficiently manage multiple tasks and contribute in a fast-paced, team-oriented environment\nMotivated to work with and learn a variety of technologies and languages\nQualifications\nBachelor’s degree in process\nLegally authorized to work in the United States without limitation\nAbility to Travel Monday - Thursday (weekly) up to 70%\nDesired skills\nStrong entrepreneurial spirit\nStrong analytical, problem-solving, and presentation skills\nStrong communication skills to be able to work with client representatives at all levels\nEnthusiastic, friendly, motivated, and positive team builders\nExperience in an object-oriented language (C#, Java, etc.) or JavaScript", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Technology Summer Intern - Application Development", "Company": "Fiserv", "Location": "Marietta, GA", "Detail Info": {"Description": "", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Healthcare Leadership Delivery Intern (Software Engineering - Hardware)", "Company": "AmericanWell", "Location": "Remote, WA", "Detail Info": {"Description": "Amwell is a leading telehealth platform in the United States and globally, connecting and enabling providers, insurers, patients, and innovators to deliver greater access to more affordable, higher quality care. Amwell believes that digital care delivery will transform healthcare. We offer a single, comprehensive platform to support all telehealth needs from urgent to acute and post-acute care, as well as chronic care management and healthy living. With over a decade of experience, Amwell powers telehealth solutions for over 240 health systems comprised of 2,000 hospitals and 55 health plan partners with over 36,000 employers, covering over 150 million lives.\nBrief Overview:\n In this fast paced, dynamic 10-week corporate internship program, we are recruiting candidates completing their first year of graduate school looking for experience in strategic work across strategic partnerships, technology, marketing, project management, business and quantitative roles. Candidates will be challenged across all functions within Amwell. Throughout the ten weeks, candidates are critically assessed for potential full time placement upon completing their two year graduate degree.\nWe can promise a 10-week intensive program aimed at providing graduate students with an experience that will enrich their understanding of the challenges and complexities of healthcare technology and service delivery. Students will have access to senior management along with executive visibility and direct supervisory support to offer guidance and feedback. Specific projects will be tailored and designed to match the candidate’s skills and career goals, as well as the department needs.\nCore Responsibilities:\nAmwell is looking for someone with NodeJS and Javascript capabilities to help us stand up an Amazon or Google IOT Core testing infrastructure. This infrastructure will include a message reliability testing backend that can automatically send and receive many different commands and metrics to multiple devices over a period of weeks or months, a device specific interface that will receive commands and send up metrics, and testing tools that will allow us to measure latency, throughput, and several other reliability aspects to verify the implementation and that the messaging scheme is reliable.\nAdditional Responsibilities:\nSoftware development with high quality, modular, well-documented, reusable code\nDesign new system features and enhancements to improve product usability and productivity.\nEnsure all system development is within design and architecture guidelines.\nDeveloping automated tests\nParticipate of code reviews and design sessions of new features\nQualifications:\nDegree in Computer Science, Software Engineering or equivalent work experience\nA solid understanding and University/Commercial experience using Typescript, Javascript\nExposure to Angular or Angular JS or equivalent MVC framework\nStrong desire and willingness to learn old/new skills and technologies as required\nAble to be part of a dynamic team and work independently with minimum supervision\nExcellent communication skills including the ability to articulate complex ideas and concepts\nWorking at Amwell:\nWe strive to make the hard work of healthcare look easy. In order to make this a reality, we look for people with a fast-paced, mission-driven mentality. We’re a go-getter culture that prides itself on quality, efficiency, smarts, initiative, creative thinking, and a strong work ethic. Amwell is headquartered in Boston, MA with additional offices in Reston, VA and Seattle, WA.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "IBM Cloud for Financial Services - Intern", "Company": "IBM", "Location": "New York, NY", "Detail Info": {"Description": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems?\n\nIBM is de-risking the global financial services industry by delivering public cloud with regulatory controls codified into the platform. On IBM Cloud for Financial Services, our customers are free to innovate in a safe, secure and compliant hybrid and public cloud ecosystem. We’re looking for visionaries who can help bring our inventions to market and drive customer awareness\n\n\nYour Role and Responsibilities\nAs an intern for the IBM Cloud for Financial Services, you will support the Financial Services Cloud leadership team and our key programs driving the evolution of cloud solutions and services to specifically support regulated and critical workloads for the financial services. You will team with the best professionals and apply your strategic and analytical skills. You will do it all in a collaborative environment that values your insight, encourages you to take on new responsibilities, promotes continuous learning, and rewards innovative thinking.\n\n\n\n\n\nRequired Technical and Professional Expertise\nFamiliarity with Public Cloud, IT Security or Financial Services industry\nStrong collaboration, communications, organization and analytical skills\nBasic Microsoft Office skills required (Word, Excel, PowerPoint, etc.)\n\n\n\nPreferred Technical and Professional Expertise\nPrevious internship or work experience\n\n\nAbout Business Unit\nDigitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nIBM will not be providing visa sponsorship for this position now or in the future.  Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Consulting Intern – Technology – Cloud & Infrastructure", "Company": "Leading Internet / Online Media Company", "Location": "New York, NY", "Detail Info": {"Description": "Ready for the next step on your career journey?\nWest Monroe is seeking consulting interns for Summer 2021 in our *Technology Cloud and Infrastructure *(C&I) practice who like to solve big business problems through cutting-edge technologies (e.g. Cloud, Data Centers, Networking, etc.) to work with our clients and support their business needs. Consulting interns will work directly with clients in various industries as a member of a highly collaborative team of the best and brightest at West Monroe.\nInterns in our Technology Cloud and Infrastructure practice have these primary responsibilities:\nExposure to full lifecycle projects from requirements gathering through design, implementation, and rollout.\nInteract with key decision-makers (CEO, COO, CIO, VP’s, Directors, etc.) to drive client projects daily.\nHave the opportunity to learn about new industries, businesses, and technologies.\nCollaborate with our clients to solve problems through the analysis of existing systems and processes.\nDemonstrate flexibility to be creative and have an impact on designs with a “blank slate” development mentality within the general boundaries of clients’ expectations.\nInterns may have the opportunity to travel to client sites to perform their duties. (Airline and Hotel points!)\nWe are looking for someone that has a passion for or is interested in:\nSolving business problems through the latest technologies and best practices from strategy development through technical implementation\nAssessing current state client business processes, gathering and defining business and technological requirements, and developing new business capabilities, processes, and supporting technologies\nEvaluating, recommending, and implementing new business capabilities and technologies that enable and drive client performance\nCollaborating directly with clients and West Monroe’s project teams to implement processes and technology that support various technical and business functions\nLearning and participating in the business development and sales process by assisting with project proposals, presentations, and new client activities\nTaking entrepreneurial ownership of the practice by contributing to the development of approaches, methodologies, and solutions for client engagements\nBuilding and demonstrating knowledge and expertise in one or several of the following areas (if you don’t know these, we will teach you!):\nOperating Systems – Windows Server, Windows Workstation, Linux/Unix\nCore Infrastructure Services – Active Directory, DHCP, DNS, NPS, file and print, etc\nEnterprise Digital Workplace Systems – Teams, SharePoint, OneDrive, and Azure AD\nEnterprise Virtualization Technology – VMware Server/ESX, Hyper-V, Citrix\nEnterprise Desktop Management, Monitoring, and Backup Solutions – Microsoft System Center, Microsoft Intune and Autopilot, PDQ Deploy and Inventory, MDT/WDS, and others\nStorage Architectures – Fiber Channel, iSCSI, and NFS SANs\nCloud Technologies – Amazon Web Services, Microsoft Azure\nFirewalls – Cisco ASA, SonicWall, NetScreen, CheckPoint (along with associated configurations including ACLs, NAT, VPN Tunneling, etc.)\nRouting Protocols – BGP, OSPF, EIGRP, MPLS, etc.\nHigh Availability System Architecture - Clustering, Load Balancing, Failover, etc.\nRouting and Switching\nSecurity Solutions – Security Information & Event Monitoring (SIEM), Identity & Access Management, IDS/IPS, Data Loss Prevention, Digital Rights Management, Network Access Control, Payments Security Technologies\nVoIP\nSystem Migrations – discovering and assessing client environments, planning and executing user, data, and hardware migrations to and from both on-premises and cloud-hosted systems\nQualifications\nBachelor’s degree in process\nLegally authorized to work in the United States without limitation\nAbility to Travel Monday - Thursday (weekly) up to 70%\nDesired skills\nStrong entrepreneurial spirit\nStrong analytical, problem-solving, and presentation skills\nStrong communication skills to be able to work with client representatives at all levels\nEnthusiastic, friendly, motivated, and positive team builder", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Summer Intern - Release Management Team", "Company": "Fiserv", "Location": "Frisco, TX", "Detail Info": {"Description": "", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Business/Marketing Analyst Intern: 2021 (Cloud Int)", "Company": "IBM", "Location": "New York, NY", "Detail Info": {"Description": "Introduction\nAre you looking for a career that will allow you to use your unique blend of business acumen and tech savvy? Business Analysts at IBM are subject matter experts that build the bridge between our business and our clients, immersing themselves into the market to understand problems and find innovative solutions. Be ready to navigate the complex relationships that make the business world run and find the actionable insights that result in great business decisions.\n\n\nYour Role and Responsibilities\nAs a Business/Marketing Analyst Intern for the Operations team within the IBM Cloud and Cognitive Software business unit, your job will enable stakeholders and leaders to make the right decisions to drive the business to succeed through operational excellence. You will influence organizational models, content planning, contribution & support processes, and take on special projects to help influence organizational excellence and innovation.\n\nCollaboration and communication skills are critical in the role. The team’s success is hinged on its ability to use data to influence IBM's business unit and geography leaders to develop and articulate a comprehensive strategy for our digital offering portfolio.\n\nYour Role and Responsibilities:\nReview Operations Manager activities to identify challenges, understand areas for improvements, define requirements, implement changes.\nPropose creative and effective solutions to solve challenges; i.e., business process improvements, implement automation, run pilot projects.\nExecute tasks as data analysis, business requirements, functional design, specification creation, user training and support.\n\n\n\nRequired Technical and Professional Expertise\nKnowledge for building responsive and engaging experiences with web technologies.\nSkilled in UI development technologies: HTML, CSS, JSON, and API usage\nWork in an Agile, collaborative environment to understand requirements, design, cost and test innovative applications.\nCreate systems that provide a great user experience along with security\n\n\n\n\nPreferred Technical and Professional Expertise\nAbility to write Cognos reports, use of Excel, knowledge of other reporting tools\n\n\n\nAbout Business Unit\nIBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}]