[{"Job": "IT Program Manager - Software Development, Agile/Scrum", "Company": "CyberCoders", "Location": "Los Angeles, CA", "Detail Info": {"Description": "Job Title: IT Program Manager\nLocation: Alhambra, CA\n\nSalary: $70k-$160k DOE\n\nRequirements: Software Development Project Management, Agile/Scrum\nTop Reasons to Work with Us\n- Competitive Base Salary ($70,000 - 160,000k DOE)\n- Medical\n\n- Dental\n\n- Vision\n\n- PTO\nWhat You Will Be Doing\n- Lead, coordinate, and manage technical projects throughout entire software development life cycle\n- Define projects and business needs, collect business requirements, and create project documentation\n\n- Serve as focal point of contact on projects for all stakeholders business, end users, management\n\n- Demonstrate leadership and excellent communication skills in all stakeholder interactions\n\n- Create and hold others accountable for timelines to ensure successful and timely project completion\n\n- Understand strategic goals, identify project risks, and clearly communicate these to stakeholders\n\n- Assist in designing, developing, and enhancing our software and applications\nWhat You Need for this Position\nMust Have Skills:\n\n\n- 2+ years of experience managing software development projects\n\n- Agile/Scrum environment experience\n\n- BS in Computer Science, Engineering, or related.\n\n\n\nNice to Have Skills:\n\n\n\n- Project Management Professional (PMP)\n\n- Certified Scrum Master (CSM)\n\n- Azure DevOps\n\n- Healthcare or managed care knowledge\nSo, if you are a IT Program Manager with experience, please apply today!\n\n\n\nCyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "CyberCoders, a division of ASGN, is a leading permanent placement recruiting firm. Through our innovative technology and efficient recruiters, CyberCoders helps find the right candidate fast.\nFounded in 1999, CyberCoders is built on a success oriented culture. Above all – we know both candidates and clients want quality and they want it now. No other recruiting firm can offer Cyrus, our proprietary technology built to search smarter and quicker, matching the best applicant to the right job.", "Profile": "https://www.monster.com/company/profiles/cyber-coders", "Website": "http://www.cybercoders.com", "Industry": "Staffing/Employment Agencies", "Headquarters": "US, Irvine, California", "Founded": "1999", "Company Size": "100 to 499 employees"}}, {"Job": "Software Development Intern", "Company": "Kratos Defense & Security Solutions", "Location": "Colorado Springs, CO", "Detail Info": {"Description": "Job Description\nKratos is seeking a Software Development Intern to join an exciting team of software engineers within the Federal Software Engineering team within the Colorado Springs area. The successful candidate will make valuable contributions to dynamic and agile projects; implementing a SecDevOps approach across all phases of the software development lifecycle, to include, design, development, test, and operational support / user feedback.\nQualities we are passionate about in a candidate:\nLoves to automate using scripts;\nDesires to be a valuable contributor within a team environment;\nEmbraces change and is an independent motivator toward one’s improvement;\nMust be self-motivated, be a self-learner, and able to work within a dynamic schedule;\nMust be able to work independently as well as within a team setting on the design, implementation, and maintenance/troubleshooting of new and existing software solutions; primarily within the satellite command and control (c2) domain space; and \nMust be able to organize & report status of tasks being worked and effectively communicate with various team members\nExperience and Skills\nMust be enrolled in a college / university majoring in a technical field, such as Computer Science, Computer Engineering, Electrical Engineering, or related.\nShows interest in technology and software development\nHas personal drive toward technology\nRelevant projects at work or at home\nAspires to learn and apply new technologies and use them to solve real problems", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Kratos Defense & Security Solutions, Inc. (Nasdaq:KTOS) is a specialized Technology Company providing mission critical products, solutions and services for United States National Security. Kratos' core capabilities are sophisticated engineering, manufacturing and system integration offerings for National Security platforms and programs. Kratos' areas of expertise include Command, Control, Communications, Computing, Combat and Intelligence, Surveillance and Reconnaissance (C5ISR) systems, satellite communications, electronic warfare, unmanned systems, hypersonic systems, directed and high power energy systems, electromagnetic railgun, missile defense, cyber warfare, cybersecurity, information assurance, and critical infrastructure security. Kratos has primarily an engineering and technically oriented work force of approximately 3,100. Substantially all of Kratos' work is performed on a military base, in a secure facility or at a critical infrastructure location.", "Profile": "https://www.monster.com/company/profiles/kratos-defense-and-security-solutions-kratosdefense", "Website": "http://www.kratosdefense.com/", "Industry": "Aerospace and Defense", "Headquarters": "US, , CA", "Company Size": "1,500 to 1,999 employees"}}, {"Job": "Staff Java Backend Software Engineer Development Cloud Services", "Company": "OSI Engineering", "Location": "Mountain View, CA", "Detail Info": {"Description": "We’re looking for an experienced software engineer to be a key contributor developing cloud-based services that will drive the future of the business in financial management.\n Responsibilities:\nStaff Software Engineer is a technical hands-on role, with responsibilities ranging from being at the vanguard of solving technical problems to venturing into unchartered areas of technologies to solve complex problems.\nDirectly responsible for consistently delivering scalable, production-ready back-end/server code in Java for Quicken Cloud Services, from design and development to deployment, as a member of an Agile development team.\nDisplay a passion for high quality, continuous learning, and experimenting and applying cutting-edge technology, software paradigms, and engineering process improvements, while fostering this culture across the team.\n Qualifications:\n10+ years of software engineering experience, including a successful track record developing customer-facing SaaS/PaaS products.\n5+ years working experience in core Java and Spring Framework, preferably with Spring Cloud Netflix.\n3+ years working experience within microservice architecture, specifically utilizing REST services, XML, and JSON.\nExtensive experience in developing applications which are deployed in AWS.\nExcellent understanding of O/R mapping concepts and tools (Hibernate, JPA).\nStrong experience as a leader, driving toward solutions for the short and long term in collaboration with internal and external partners.\nFluent in Databases/SQL (MySQL experience preferred).\nExcellent programming discipline: data structures, complexity analysis, object-oriented principles, design patterns, and unit testing.\nExcellent knowledge of the development challenges inherent with highly scalable and available web/mobile applications.\nTeam player with can-do attitude to independently own and drive projects.\nCapable of handling ambiguous business requirements with excellent prioritization and time management abilities.\nStrong experience working with an Agile development team with rapid iterations. \nAbility to work well with others in a geographically distributed team.\nExperience with API development and integration with 3rd-party services is preferred.\nExceptional verbal and written communication skills.\nBS/MS in Computer Science/Engineering or equivalent.\n  Contract: Fulltime\nSubmit resume to jobs@OSIengineering.com\n David Gutierrez\n408.550.2800 x110\nOSIJOBS", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Senior Software Engineer Communications as a Service (CaaS)", "Company": "BOEING", "Location": "Lake Saint Louis, MO", "Detail Info": {"Description": "Tapestry Solutions, A Boeing Company, comes with over 30 years of industry experience designing, implementing, training and supporting logistics information systems.\nWe have over 800 employees worldwide supporting our customers with high-quality, innovative, and cost-effective information technology and business intelligence solutions. Tapestry Solutions supports 85 defense, commercial and government customers from over 50 US locations and nine countries, including multiple forward operating bases overseas.\nTitle: Senior Software Engineer\nLocation: Maryland Heights, MO\nPosition Summary:\nThe Communications as a Service (CaaS) program is a key enabler of the USN Naval Integrated Fires concept and part of the USN’s Project Overmatch (analogous to USAF Joint All Domain Command and Control (JADC2) effort.  The product is destined for ships, aircraft and submarines, both manned/unmanned. CaaS is fundamentally a software defined networking (SDN) router.  It prioritizes network routing based on hierarchical priorities, (i.e. Fire Control, Command & Control, Admin & Logistics).  Capability was developed under an Office of Naval Research (ONR) Future Naval Capability (FNC) Science & Technology S&T contract and is ready to be made operational.  Initial phase will convert Python to C++ code and transition capability to operational hardware.  This is a ground floor opportunity to participate in a new program with opportunities for significant growth.\nThis position offers the opportunity to lead and mentor a team in defining requirements, development, integration and testing of mission planning software for the US Air Force and foreign customers. In this role, you will be part of a multi-disciplined team of engineers that take pride in delivering innovative solutions to a variety of challenging customer needs. We value the curiosity, tenacity and imagination you’ll bring to our teams each day.\nEssential Functions:\nActs as representative for customer, user and other stakeholders\nAssists with the development, documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems.\nDevelops and maintains code and integrates software components into a fully functional software system.\nAssists with test procedures and documenting test results to ensure software system requirements are met.\nSupports software project management and software supplier management functions.\nSelects, tailors and deploys processes and tools; establishes metrics.\nPerforms software research and trade studies.\nTroubleshoots software issues.\nWorks under general supervision.\nParticipates in the daily scrums, sprint planning meetings, and sprint reviews and retrospectives\nLearns and provides domain expertise and guidance\nDefines definition of done and minimum viable product definition for program increments\nInitiates software version promotion and validation of formal requirements\nAnalyzes and provides evaluation of development cycle performance \nDevelop, select, tailor and deploy processes and tools; establish metrics; and utilize regulations and industry standards.\nParticipate in process reviews.\nProvides guidance to less experienced employees, performs research, may contribute to proposals, documents research and development results and aids technology transfer into programs.\nProvides subject matter expertise to other technical and support personnel.\nPerforms other duties as assigned.\nSecurity Clearance:\nThis position requires the ability to obtain a US Security Clearance for which the US Government requires US Citizenship.  An interim and/or final U.S. Secret Clearance Post-Start is required\nRequired Education and/or Experience:\n5+ years of experience in programming in C#, C++, Java, Python, Visual Basic\n1+ years of experience architecting software solutions\n1+ years of experience with MS SQL, Oracle, or MySQL\n1+ years of experience as an Agile software development team lead\nPreferred Education and/or Experience:\nExperience working with Linux operating systems including Red Hat or Solaris\nBachelor, Master or Doctorate of Science degree from an accredited course of study, in Computer Engineering, Software Engineering, Computer Science, Mathematics, or other technical degree\n1+ years of experience do you have in source control management using Team Foundation Server (TFS) or Azure\n1+ years of experience with mission planning\nFamiliarity with networking communications standards, IP Networking, and protocols (e.g. Transport Control Protocol/Internet Protocol (TCP/IP), File Transfer Protocol (FTP), Secure Transport Protocol (SCP), Extensible Mark-up Language (XML)\nTypical Education and/ or Experience Qualifications:\n Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 9 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD+4 years' related work experience, Master+7 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\nRelocation:\nThis position is located in a location that does not offer relocation. Candidates must live in the immediate area or relocate at their own expense.\nDrug Free Workplace\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\nGeneral\nAll information provided will be checked and may be verified.\nPlease apply ASAP for this role as recruitment may commence before the end date.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At Boeing, you can build something better for yourself, our customers, and the world. Here you can transform aerospace and make history. And you’ll work alongside other experts and visionaries who lead and inspire. Our workforce includes every profession and career path you can imagine, taking you as far as you can dream.", "Profile": "https://www.monster.com/company/profiles/boeing-boeing", "Website": "https://jobs.boeing.com/", "Industry": "Aerospace and Defense", "Headquarters": "US, Chicago, IL", "Founded": "1916", "Company Size": "10,000 employees or more"}}, {"Job": "Senior Software Development Engineer", "Company": "Kelly Mitchell", "Location": "O'Fallon, MO", "Detail Info": {"Description": "Senior Software Development Engineer\nO'Fallon, Missouri | IT\nJob ID: 103974\nListed on 2/26/2021\nKellyMitchell matches the best IT and business talent with premier organizations nationwide. Our clients, ranging from Fortune 500 corporations to rapidly growing high-tech companies, are exceptionally served by our 1500+ IT and business consultants. Our industry is growing rapidly, and now is a great time to launch your career with the KellyMitchell team.\nSenior Software Development Engineer\nDuties:\n\n· Review requirements, specifications and technical design documents\n· Create detailed, comprehensive and well-structured test plans and test cases\n· Design, develop and execute automation scripts using open source tools\n· Identify, record, document thoroughly and track bugs\n· Perform thorough regression testing when bugs are resolved\n· Develop and apply testing processes for new and existing products to meet client needs\n· Work with internal developers and product team to identify system requirements\n· Track quality assurance metrics, like defect densities and open defect counts\n· Stay up-to-date with new testing tools and test strategies\n· Look for opportunities to improve software architecture from a quality perspective\n Desired Skills/Experience:\n· Proven work experience in software development\n· Proven work experience in software quality assurance\n· Strong knowledge of software QA methodologies, tools and processes\n· Experience in writing clear, concise and comprehensive test plans and test cases\n· Hands-on experience with both white box and black box testing\n· Hands-on experience with automated testing tools\n· Solid knowledge of SQL and scripting\n· Experience working in an Agile/Scrum development process\n· Experience with performance and/or security testing is a plus\n *mjp123", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Product Owner (Software Development)", "Company": "ASRC Federal Holding Company", "Location": "Fort Collins, CO", "Detail Info": {"Description": "Position: Business Analyst / Product Owner Liaison\nWork Location: Fort Collins, CO\nSummary:  ASRC Federal Highliand Technology is seeking a Product Owner to lead one of our many agile teams from a product perspective to develop and deliver complex custom software--including COTS integration--in an enterprise class web application environment.\nResponsibilities:\nWorks closely with Government Subject Matter Experts and Product Managers to break Features down into Stories for the development team\nCollaborates with other teams and ARTs and the Solution Managers, and with fellow Product Owners and Architects to deliver complete solutions\nCoordinates with the team Scrum Master and the agile development Team to refine stories\nBuilds, owns, maintains, and prioritizes the team backlog of stories, defects, and enablers\nRepresents the voice of the customer to the development team\nUnderstands and customer needs\nAccepts completed stories\nUnderstands and supports the greater solution, business context, and user perspectives\nLeads story refinement at PI Planning and Iteration Planning\nWork with Architects to understand enabler work\nParticipates in demos and inspect and adapt events", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "ASRC Federal comprises a family of companies that provide mission-critical services to federal government agencies dedicated to defense, civil and intelligence support. Our customer-focused service delivery model and emphasis on operational excellence are foundational elements infused in all our companies. The reliability and quality of day-in, day-out service delivery from our family of companies ensure our customers that we keep our sights on their mission-critical priorities.", "Profile": "https://www.monster.com/company/profiles/asrc-federal", "Website": "http://www.asrcfederal.com", "Industry": "Aerospace and Defense", "Headquarters": "US, Beltsville, Maryland", "Founded": "2003", "Social Networks": "facebook", "Company Size": "5,000 to 9,999 employees"}}, {"Job": "Software Development Analyst / Full-Time / Days", "Company": "Chestnut Health Systems", "Location": "Normal, IL", "Detail Info": {"Description": "Overview\nChestnut Health Systems is seeking a full-time Software Development Analyst for our Normal, IL location.\n Chestnut Health Systems is a leading provider of behavioral and primary health care services. Over four decades, Chestnut has grown to over 700 committed, compassionate employees providing substance use, mental health and primary care treatment to patients in Central and Southern Illinois. We provide fully integrated care for all of our patients by combining behavioral health care services with our community-based primary care health centers. Chestnut also conducts research and training throughout the U.S.A.\n**Please note to be considered for a position you must attach a resume, complete the application, and answer all screening questions. \nResponsibilities\nWork with supervisor, team members and/or customers in the development of software specifications.\nDesign, build and maintain software intermediate level applications using modern development techniques, efficient, reusable and reliable code.\nIdentify problems, bottlenecks and bugs, and devise solutions to these problems.\nDevelop and implement software test plans.\nWork collaboratively, participate in team meetings and maintain frequent communications with development team members and others involved in the development process.\nWrite technical documentation and provide support/training to end users as required.\nPromote Chestnut’s culture of customer service excellence through the adherence to Chestnut’s behavioral standards for customer service.\nQualifications\nBachelor’s degree in Computer Science or related field and three (3) years’ experience working as a programmer/developer; OR an equivalent combination of education and software development experience.\nExperience developing and maintaining full-stack software in a .NET environment.\nProficient in C#.Net.\nExperience with HTML, JavaScript and web development frameworks (Bootstrap, jQuery).\nExperience with Relational Databases and SQL.\nStrong understanding of object-oriented programming and familiarity with common design patterns.\nExperience with REST web service development.\nProfessional experience developing and implementing test plans.\nProfessional experience working as part of a software development team.\nProfessional experience writing technical documentation.\nFamiliarity with Entity Framework and Code First migrations is a plus.\nExperience with cross-platform development is a plus.\nWillingness and commitment to work after hours to meet key project deadlines and to travel to site to review local activity.\nAbility to communicate with both non-technical and statistical staff, good customer service approach and flexibility, strong technical skills and attention to detail, able to meet deadlines.\nAbility to define problem, ask questions of senior staff before and during the process, attempt a draft of deliverables for review, and revise upon receipt of comments.\nSatisfactory Completion of Chestnut’s background checking process. \nThis full-time position includes an excellent compensation and benefits package including health, dental, vision, life, and disability insurance, a retirement savings plan, generous paid time off benefits, and more.     \n        ***For additional information and inquiries text \"Chestnut\" to 97211\n Chestnut welcomes applications from qualified individuals with recovery experience.\n EOE – Minorities/Females/Vets/Disabled", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Chestnut Health Systems is a non-profit organization that has cared since 1973 for persons needing behavioral health services. Chestnut provides substance use disorder treatment, mental health counseling, primary health care, credit counseling, and housing and supportive services. Headquartered in Bloomington, Illinois, Chestnut employs more than 700 professionals at 25 facilities. Chestnut's staff is motivated by our corporate mission - Making a Difference: Improving Quality of Life Through Excellence in Service.", "Profile": "https://www.monster.com/company/profiles/chestnut-health-systems", "Website": "https://chestnut.org/", "Industry": "Healthcare Services", "Headquarters": "US, Bloomington, Illinois", "Company Size": "500 to 999 employees"}}, {"Job": "Sr Software Developer: Cloud Development", "Company": "IBM", "Location": "Austin, TX", "Detail Info": {"Description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do.  Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide.  At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\n\nYour Role and Responsibilities\n\nThe candidate will design, document, implement, test, and deliver compute solutions for the IBM cloud control plane as a member of the IBM Cloud Compute Team.\n\nResponsibilities will include root cause investigation, resolution, and remediation of issues reported internally and externally by customers; enhancements to diagnostic software and tools for quicker root cause determination, development to ensure reliability and stability of the compute virtualization software architecture and components with a zero downtime goal.\n\nAreas of responsibility will include but are not limited to the following:\nClient reported issues in the areas of VM lifecycle, failure scenario detection and remediation, non-disruptive software upgrade, guest OS images, guest custom images, QoS, and the virtualization stack.\n\n\n\nRequired Technical and Professional Expertise\n2+ years of relevant software development experience\nExperience with large distributed systems\nExperience with Golang, Kubernetes, micro-services architecture, and Docker containers\nExperience with hypervisors/compute virtualization (e.g. KVM/libvirt/QEMU)\nExperience with Agile software development\nStrong debug skills, effective verbal and written communication skills, team oriented\n\n\n\nPreferred Technical and Professional Expertise\nFamiliarity with the Linux OS and RedHat Openshift,\nGitHub, JIRA, gRPC, RESTful APIs\n\n\n\nAbout Business Unit\nDigitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics.\n\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\n\nLocation Statement\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nIBM intends this job to be performed entirely outside of Colorado.\n\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\n6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0 6fac3445-56d8-4266-bac0-8ecc824adda0", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "At IBM, you don’t need a degree to shape the future. Just bring your skills—and your passion. To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate.\nNot just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems. Let’s get to work.", "Profile": "https://www.monster.com/company/profiles/ibmcorporation", "Website": "http://www-03.ibm.com/employment/us/", "Industry": "Computer/IT Services", "Headquarters": "US, Armonk, New York", "Founded": "1911", "Company Size": "10,000 employees or more"}}, {"Job": "Software Developer - Java", "Company": "ULINE", "Location": "Pleasant Prairie, WI", "Detail Info": {"Description": "Software Developer - Java\nCorporate Headquarters\n12575 Uline Drive, Pleasant Prairie, WI 53158\n\nUncover your full potential in a collaborative environment where you'll design, develop and deliver custom solutions to big challenges. And you'll be doing it for a proven industry leader that runs one of the largest e-commerce sites in the U.S.\n\nBetter together than apart. This position is on-site, and we are looking for good people who share our passion.\n\nUline is proud to operate as a drug-free workplace. All new hires must complete a pre-employment drug screening.\n\nPosition Responsibilities\nApply industry best practices and techniques to design, develop, test, deploy, support and maintain complex Java applications based on business requirements using approved technologies and coding standards.\nAssist in project planning and architectural design reviews.\nMentor other Developers on programming issues.\nWork with Development team to ensure consistency in processes and completion of deliverables among team members.\nExhibit leadership in cross-functional development practices and application ownership.\n\nMinimum Requirements\nBachelor's degree in Computer Science or Software Engineering, or Bachelor's degree with relevant programming experience.\n5 years hands-on Java development experience.\nStrong experience in delivering enterprise solutions with Spring framework using Spring Boot, JDBC, Security and MVC.\nExtensive experience in developing and consuming REST webservices and working in a micro-service environment.\nExpert-level knowledge of Git, JDBC, SQL, database-stored procedures and isolation levels, JPA, SOAP, REST and XML.\nWorking knowledge of caching, service discovery and circuit-breaker patterns and concepts.\nExperience with Agile, Angular, Dynatrace, Cassandra or ELK a plus.\n\nBenefits\nComplete insurance coverage that includes medical, dental, vision and life insurance, Flexible Spending Accounts and wellness programs.\n401(k) with 5% employer match.\nPaid holidays and generous paid time off.\nBonus programs include annual performance, sales goals and profit sharing.\nScholarship program for children of employees.\n\nEmployee Perks\nOn-site café with executive chefs and seasonal dinner-to-go options.\nFirst-class fitness center with complimentary personal trainers.\nOver four miles of beautifully maintained walking trails.\nNumerous employee appreciation events throughout the year.\nProfessional development classes and monthly in-house speakers.\n\nAbout Uline\n\nUline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, our 800+ page catalog of over 37,500 quality products and same-day shipping of our huge in-stock inventory. With over 7,000 employees across 12 locations, it's time you joined Uline.\n\nUline provides the essential supplies needed to keep organizations operational and productive. To protect the health and safety of our employees, we have modified our normal operating policies in response to COVID-19.\n\nEach resume submitted gets individually reviewed by our team and retained for 24 months in case a great opportunity opens for you to join our Uline family.\n\nUnfortunately, Uline is unable to offer US work sponsorship at this time.\n\nEEO/AA Employer/Vet/Disabled\n\n#LI-SN1\n#CORP", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "In 1980, Liz and Dick Uihlein recognized a local need for a shipping supply distributor and started Uline from their basement. Their first product was the\nH-101 carton sizer (still offered today). From those humble beginnings, the business has grown far beyond their expectations, while still remaining a family-owned and run company.\n\nUline is now North America's leading distributor of shipping, packaging and industrial supplies with over 1,650 box sizes in stock. Product lines have expanded to include retail, safety, material handling and janitorial items. Uline's 812-page catalog reaches businesses nationwide, offering 37,500 products always in stock for quick delivery.\n\nWith over 6,500 employees in North America, Uline has distribution centers near Chicago, IL; Minneapolis, MN; Allentown, PA; Los Angeles, CA; Atlanta, GA; Dallas, TX and Seattle, WA, as well as international locations near Toronto and Edmonton, Canada and in Mexicali and Monterrey, Mexico.\n\nUline is a drug-free workplace.", "Profile": "https://www.monster.com/company/profiles/uline-1", "Website": "https://www.uline.jobs/", "Industry": "Business Services - Other", "Headquarters": "US, Pleasant Prairie, Wisconsin", "Founded": "1980", "Social Networks": "youtube", "Company Size": "5,000 to 9,999 employees"}}, {"Job": "Sr. Software Development Engineer", "Company": "Sonos, Inc", "Location": "Boston, MA", "Detail Info": {"Description": "Sr. Software Development Engineer sought by Sonos, Inc. in Boston, MA. Dsgn, documentation & implmtn of new app features & algorithms. Req: BS +2 yrs. Resume to: Carmen Palacios, Sonos, Inc., 614 Chapala St, Santa Barbara, CA 93101. Ref job code: TZ0724.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Software Development Engineering Co-Op - Summer", "Company": "Honeywell", "Location": "Pittsburgh, PA", "Detail Info": {"Description": "Join the industry leader to design the next generation of breakthroughs\nThe future is what you make it.\nWhen you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all our employees enjoy access to dynamic career opportunities across different fields and industries. \nAre you ready to help us make the future?\nJoin a team that designs, develops and integrates highly complex software applications within Honeywell. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.\nUse your skill set to provide value added software features to our products for our customers.\nAccelerate innovation and growth, teaming with the world's most talented engineers.\nWe invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for!\nYOU MUST HAVE\n·       Currently pursuing a Bachelor’s or Master’s degree from an accredited college or university in Engineering or Computer Science \n·       Must graduate after December 2021\n·       Must continue enrollment in degree program upon completion of the internship\nWE VALUE\n·       Understanding various software development lifecycle\n·       Demonstrate the ability to develop efficient and high-quality software\n·       Knowledge of software configuration management and change management practices\n·       Diverse and global teaming and collaboration\n·       Excellent oral and written communication skills\n·       Effective communicator\n·       Can quickly analyze, incorporate and apply new information and concepts\n·       Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness\n·       Validated academic excellence (3.0 GPA and higher)\nAdditional Information\nJOB ID: req241276\nCategory: Engineering\nLocation: 2555 Smallman St, 2nd Fl,Pittsburgh,Pennsylvania,15222,United States\nNonexempt\nEarly Career (ALL)\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Software Application Developer/Analyst 1 (Kapow)", "Company": "Swift Transportation", "Location": "Phoenix, AZ", "Detail Info": {"Description": "Primary Purpose and Essential Functions: Design and develop a series of programs in accordance with a defined system design; perform as a key participant in the integration, system testing, training and implementation activities. Develop systems and program specifications for programmers and outside consultants when applicable.\nPerform program design, coding, testing, development and documentation activities of programs of average complexity according to specifications, standards and system requirements in order to accomplish ideal business functions. Assume role of increasing responsibility in defining information system requirements and system design.\nConsult with users to identify current operating procedures and to clarify program objectives; determine valuable modifications to the program and execute improvements in order to achieve exceptional system efficiency. Responsible for drafting and revising as necessary Functional Requirements Documents (FRDs).\nParticipate in integration, training and implementation activities as defined by project supervisor.\nDevelop technical specifications, project plans and time requirements for average size projects or packaged software implementation under direct supervision.\nPerform additional project leadership, tracking and control activities for assigned projects; report status updates accurately and assure that direct supervisor is made aware of all problems or potential problem situations in a timely and professional manner.\nRefine and update technical/business skills and experience through work assignments, advanced technical/business training and attending professional/business industry conferences.\nMaintain a positive work atmosphere by acting and communicating in a manner which facilitates the success of business operations in order to meet company demands and expectations.\nPerform additional responsibilities as assigned by leadership.\nSkills: Must possess excellent interpersonal skills. Must be able to prioritize and plan work activities appropriately. Must be able to multi-task. Must be able to collaborate with others.\nEducation: High school diploma or equivalent. Degree in computer science or related field or equivalent combination of education and/or experience preferred.\nExperience Required: One (1) year programming experience required. Experience with Kapow and SQL preferred.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Swift Transportation began operations on October 10th, 1966 transporting imported steel through the ports of Los Angeles to Arizona and Arizona cotton for export back through to Southern California. Jerry Moyes, founder, began with the same entrepreneurial, can-do spirit that is one of Swift’s core values today. The original operation was conducted under the name of Common Market. Operating authority was purchased from a descendant of the Swift Meat Packing family, hence, today’s name of Swift Transportation. Jerry, with his father, brother and a partner, grew the business, with typical start up challenges, to a $25 million annual revenue in 1984. With the passing of Jerry’s father, Carl Moyes, Jerry became the sole owner. By 1990, Swift had grown to a $125 million carrier with 800 trucks. Swift’s significant revenue growth is attributable to internal growth with existing customers as well as acquisitions. Since 1988, Swift has acquired 13 different motor carriers. Today, Swift generates over $4 billion in revenue and operates nearly 20,000 trucks. Swift’s terminal network has grown to over forty full service facilities in both the continental United States and Mexico. Swift owns 100% of Trans-Mex, a Nuevo Laredo, Mexico based carrier. Swift offers border crossing services at all major Mexican border crossings. Swift maintains a presence in every Canadian province each day. Swift is unquestionably the largest full-truckload motor carrier in North America.", "Profile": "https://www.monster.com/company/profiles/swift-transportation-1", "Website": "https://www.swifttrans.com/", "Industry": "Transport and Storage - Materials", "Headquarters": "US, Phoenix, Arizona", "Founded": "1966", "Company Size": "10,000 employees or more"}}, {"Job": "Software Development Engineer", "Company": "London Stock Exchange Group Holdings Inc. (LSEGH Inc.)", "Location": "New York, NY", "Detail Info": {"Description": "London Stock Exchange Group Holdings Inc. (LSEGH Inc.) seeks a Software Development Engineer (Job Code 15855) in New York, NY to design and build new web services in Java to deliver fixed income analytics and data, and to support and extend existing systems with new functionality. Mail resume referencing Job Code 15855 to Human Resources, ATTN: George Meeks, LSEGH Inc., 580 Kingsley Park Dr., Fort Mill, SC 29715. EOE.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Software Development Manager", "Company": "Walrath Recruiting, Inc.", "Location": "Saratoga Springs, NY", "Detail Info": {"Description": "Our client is currently seeking a Software Development Manager to join their growing team. This is a full-time, permanent position with benefits.\n\nResponsibilities Include:\nCommunicate with software users to ensure efficient functioning of the systems.\nAssist with system design and scheduling software releases.\nProvide technical support for existing software via email, phone and face-to-face.\nPlan, coordinate and direct the activities of other programmers to ensure best practices are met.\nMaintain documentation regarding system process, UI design and security.\nWork with design team and other IT leadership to set forth and achieve future goals.\nQualifications:\nBachelor's Degree in Computer Science or related field is a must.\n7+ year(s) of software development experience.\nExperience with legacy apps using VB with .NET Framework.\nMust provide quality leadership and work efficiently in a team setting.\nProficient in Microsoft Office Suite.\n\nWalrath Recruiting, Inc. specializes in executive search, direct-hire, and long-term and short-term contract placement services in the Accounting/Finance, Engineering, Construction, Manufacturing, IT/Technology, Medical, Legal, industries. With locations in Albany and Saratoga, Walrath Recruiting serves a number of organizations in NY State’s Capital Region and often extends its services throughout the United States.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Walrath Recruiting, Inc. is a NYS certified Woman-Owned Business Enterprise, that provides recruiting services to NY’s Capital Region and beyond. The main office location is in Albany, with a satellite location in Saratoga Springs. Although we have a strong local presence in the Capital Region, we frequently work with both clients and job applicants nationwide. We specialize in, but are not limited to, the Accounting, Finance, Human Resources, Sales, Legal, IT and Medical industries, and staff all types of positions including direct hire, long-term contract, and contract to hire openings. We also offer executive search services, providing the highest quality candidates for the highest level positions.", "Profile": "https://www.monster.com/company/profiles/walrath-recruiting-inc", "Website": "http://walrathrecruiting.com/", "Industry": "Staffing/Employment Agencies", "Headquarters": "US, Albany, New York", "Founded": "2010", "Social Networks": "instagram", "facebook": "twitter", "Company Size": "1 to 9 employees"}}, {"Job": "Software Development Engineer", "Company": "Paramount Software Solutions, Inc", "Location": "Alpharetta, GA", "Detail Info": {"Description": "Paramount Software Solutions, Inc. seeks Software Development Engineer in Test (SDET) in Alpharetta, GA & various unanticipated locations to design, develop and enhance the Salesforce CRM software application. Degree & commensurate exp. req'd. Send C.V. & cvr ltr to P. Sajja, 4030 Old Milton Pkwy, Ste 200, Alpharetta, GA 30005.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Software Development Engineer", "Company": "Fuyao", "Location": "Moraine, OH", "Detail Info": {"Description": "IT Software Development Engineer sought by Fuyao Glass America Inc., located in Moraine, OH. Dsgn, dvlp, & modify internal s/ware solutions of E-R-P system. Reqs Bach's deg in S/ware Engg or related. Knowl of Plex system function, ability to independently set production, quality, planning, E-D-I, sales, procurement, & other modules, operate & maintain the system, & solve daily problems. Knowl of Microsoft S-Q-L Server D/base & dot-Net dvlpmt tools, & ability to independently complete the s/ware dvlpmt of inventory related modules in the Visual studio dvlpmt platform.\nTo apply, please send resume to Cathy DeMarco at cdemarco@fuyaousa.com", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Mobile Developer", "Company": "Fidelity TalentSource", "Location": "Merrimack, NH", "Detail Info": {"Description": "Fidelity TalentSource is your destination for discovering your next temporary role at Fidelity Investments. We are currently sourcing for a Mobile Developer to work in Fidelity’s Workplace Investing group in Merrimack, NH.\nWe're looking for product-aware engineers who are hardworking and responsible individuals to help deliver the best mobile experience to our customers. The ideal candidate is deeply entrenched in mobile development, with a passion for demonstrating the right tools and frameworks to guide the development of stable, robust, and resilient apps that best serve our customer base.\nThe Team\nFidelity's Workplace Investing (WI) Mobile and Emerging Technology team designs, develops, implements and supports WI's suite of Internet products and services for mobile and other emerging technologies. The Mobile and Emerging Technology development teams are passionate about delivering innovative solutions that meet the needs of our customers. Our systems professionals thrive with an unyielding commitment to innovation, which fosters a culture of continuous improvement and significant achievement. We see ourselves as a vital link to Fidelity's customers. This is a fast-paced group that is using groundbreaking technologies to build powerful tools and a best in class user experiences for our customers using mobile native, hybrid and cloud technologies.\nAs a Mobile Software Engineer Developer, you are responsible for developing mobile applications using native and web technologies. The individual selected, will be part of an agile team and will play a key role in working with other developers, analysts and QA in understanding the business requirements and developing solutions to deliver with excellent quality and on time.\nThe Expertise You Have\n7+ years of proven experience developing mobile apps leveraging Ionic, Angular, Typescript, JS, HTML5, CSS, Java and Spring\nParticipated in the release of at least 1 publicly-available app to the App Store participating from inception to launch using automated tooling like Jenkins, Fastlane, and XCode toolchain\nThe Skills You Bring\nYour passion building amazing hybrid and native experiences on Android platforms using Kotlin\nHybrid mobile application development using Ionic, Cordova/Phonegap, Angular, HTML5, CSS, Typescript, JS, Java and Spring\nKnowledge of consuming HTP based APIs/RESTful JSON APIs is required\nDevOps CI/CD, QA Automation, uDeploy, Jenkins\nAdvanced GIT, hands on command line and shell script development experience\nYour desire to delight our clients with the latest mobile technologies using your knowledge of iOS design patterns including MVP and MVC\nKarma and Jasmine experience are a plus, but not required\nFamiliarity with Test driven development, static code analysis and secure code scan\nPerforms good unit testing and peer reviews before delivering code to QA\nPassion for writing readable, maintainable and well-tested code and supporting technical design documentation\nExcellence in communication and interpersonal skills\nDesire to teach/mentor other developers on your team and demonstrate leadership skills\nExposure to Agile development methodology is required. Candidate will participate in daily scrums, optimally communicate status during standup and brings attention to issues for resolution.\nThe Value You Deliver\nCollaborating with architecture, security, and UXD to build architecturally-compliant apps and offer valuable input on efficient ways to develop given functionality\nProviding mobile thought leadership to advance WI's mobile outcomes and facilitate a mobile-first attitude\nServing as Mobile advocates for the adoption of experiences that seek the needs of our digitally-minded customers ?\nStaying ahead of the curve by aligning architecture, user experience, and security with chapters and COEs?\nSupporting a mobile-first world through upskilling and augmenting squads with deep mobile expertise\nCollaborates with systems/business analysts and tech leads to define system specs for features.\nTakes ownership of assigned work and delivers high quality solutions.\nBe an active member of an Agile team\nRegularly provides mentorship and training to enable other team members to meet/exceed expectations\nDevelops technical guidelines/standards and makes them accessible to other developers\n\nCompany Overview\nFidelity TalentSource, formerly Veritude, is the in-house temporary staffing provider for Fidelity Investments, one of the largest and most diversified global financial services firms in the industry. We recruit individuals from a variety of backgrounds, including technology and customer service, to fill assignments across Fidelity’s U.S.-based regional and investor center locations. If you would like to experience Fidelity’s diverse and inclusive workplace while expanding your skill set and developing your professional network, consider a role with Fidelity TalentSource. For information about working at Fidelity TalentSource, visit FTSJobs.com.\nFidelity TalentSource will reasonably accommodate applicants with disabilities who need adjustments in order to complete the application or interview process. Please email us at HR@ ftsjobs.com if you would like to request an accommodation.\nInformation about Fidelity Investments\nAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. We are proud of our diverse and inclusive workplace where we respect and value our associates for their unique perspectives and experiences. For information about working at Fidelity, visit FidelityCareers.com.\nFidelity Investments and Fidelity TalentSource are equal opportunity employers.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Fidelity TalentSource, formerly Veritude, is the in-house temporary staffing provider for Fidelity Investments, one of the largest and most diversified global financial services firms in the industry. We recruit individuals from a variety of backgrounds, including technology and customer service, to fill assignments across Fidelity’s U.S.-based regional and investor center locations. If you would like to experience Fidelity’s diverse and inclusive workplace while expanding your skillset and developing your professional network, consider a role with Fidelity TalentSource.", "Profile": "https://www.monster.com/company/profiles/fidelity-talentsource", "Website": "https://www.fidelitytalentsource.com/", "Industry": "Staffing/Employment Agencies", "Headquarters": "Boston", "Founded": "1986", "Company Size": "2,500 to 4,999 employees"}}, {"Job": "Senior Application Developer", "Company": "Fremont Bank", "Location": "Hayward, CA", "Detail Info": {"Description": "Are you ready for an exciting new, fast paced work opportunity?\nFremont Bank offers a very attractive employment package that includes:\nVarious Recognition Programs including Monetary Spot Bonuses!\nUp to $5000 Tuition Reimbursement for continued education!\n10 Paid Bank Holidays!\nPaid Vacation!\nPaid Sick Time!\nAn ESOP (Employee Stock Ownership Plan) = Retirement Money!! \n401K Plan with an employer match!\nREADY TO LEARN MORE & APPLY?! Keep Reading!!!\n Fremont Bank founded in 1964, is one of the oldest independently owned banks in the Bay Area and is one of the top rated mid-tier banks in the nation. Voted a Top Workplace for 2020 and for the past ten consecutive years, Fremont Bank has an immediate opening for a Senior Application Developer in Hayward, CA.\nPosition Overview\n\nThe Senior Application Developer reviews, analyzes, modifies, and creates applications including coding, testing, debugging, integration and installations. The Senior Application Developer documents technical requirements for databases, applications, and technology infrastructure. The Senior Application Developer consults with team members and bank associates to identify current operating procedures and business processes, to clarify program objectives, gather requirements, and test and debug applications.\n\nRole and Responsibilities\nProvides expertise in all aspects of application and system design and application development which may include interfaces and backend databases\nRelies on extensive experience and judgment to plan and accomplish goals\nPerforms a variety of complicated tasks with minimal oversight\nPerforms application support to both internal and external clients\nConducts training to IT Department and Bank staffs\nWill be on call for application support\nInstall and test software packages\nInstall and maintain operating systems software\nMaintain program libraries, user manuals, or technical documentation\nDesign new systems or enhancements to existing systems\nDesign, implement, and document procedures\nDesign/modify, code, debug, test, and document application systems\nWill perform other duties as assigned\nMinimum Qualifications\nBS in Computer Science, Information Systems, Computer Engineer or related field\nMinimum 7 years of experience in the field of application development or in a related area\nAdvanced level of experience with .NET, .NET Core, and C# development and  understand its capabilities\nAdvanced knowledge of MS SQL Server database technology, ETL, T-SQL, SSRS and SSIS\nAdvanced knowledge of web development and technologies e.g. IIS, Apache, ASP.NET, Classic ASP, PHP, etc.\nAdvanced knowledge of Web Applications, Windows Services, ESB, Web Services, Micro Services, SOA, MVC, Windows Applications and Console Applications\nAdvanced knowledge of code version control and bug tracking systems (TFS)\nAdvanced knowledge in coding and debugging  in Visual Studio 2015 and higher\nAdvance Knowledge in coding SAML, XML and  HTML5\nCommunication skills: verbal, both  one-on-one and with a group, and written\nExcellent communication skills with  technical/non-technical roles and clients\nStrong verbal, written, and analytical skills and the ability to communicate and interact with Bank associates  and management\nSkilled in using team-based tools such as  brainstorming, organizing, and decision making\nExcellent Analytical skills and creative  approach to problem solving\nExperience in SDLC, Project Methodologies (traditional, agile and scrum)\nExperience in developing responsive web  design and mobile\nExperience in working with Virtual Desktop Infrastructure, MS SQL Server 2016 and higher\nExperience in custom development and  administration of CMS, Microsoft SharePoint (2016 and higher), and Microsoft CRM Dynamic (2016 and higher)\nExperience with iPaaS platform (Dell Boomi prefer)\nJob Location: Hayward, CA\nReady to join the fun!! Apply NOW…Click link below\nhttps://fremontbank.csod.com/ats/careersite/JobDetails.aspx?site=1&id=1546", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Want the full-service, personal approach only a community bank can offer? Discover a better way to bank with an organization that knows the Bay Area because we've been doing business here for over four decades.\nAt Fremont Bank, we know that community banking makes a difference to our customers, our business partners and our employees. After all, we were founded in 1964 - one of the oldest independently owned and managed bank in the Bay Area, headquartered in Fremont, of course. We've held to an unwavering commitment to providing the communities we serve with financial resources and building professional relationships second-to-none.", "Profile": "https://www.monster.com/company/profiles/fremont-bank-fremontbank", "Website": "https://www.fremontbank.com/", "Industry": "Banking", "Headquarters": "US, Fremont, California", "Founded": "1964", "Social Networks": "youtube", "facebook": "twitter", "Company Size": "500 to 999 employees"}}, {"Job": "Software Systems Engineer (El Segundo, CA)", "Company": "Johns Hopkins Applied Physics Laboratory (APL)", "Location": "El Segundo, CA", "Detail Info": {"Description": "Do you have a passion for software engineering? Are you familiar with ground system architectures within larger space-based systems? If so, we're looking for someone like you to join our team at APL.\nAs a Software Systems Engineer, your role will be to work closely with Government sponsors to develop system CONOPS, define software architectures for sponsor solutions in the DoDAF construct, work with stakeholders to define system requirements, and assist sponsors to ensure user needs are met and contractors are meeting requirements and deliverables. You will act as a Technical Advisor Agent to sponsors in architecture and program development and in contractor program reviews, both internal and external.\nIn addition, you will:\nApply systems engineering processes to define and translate concepts and identify architecture technical requirements, with a focus on the software elements in space-based ground systems. Participate in system design, development, prototyping, demonstration, and testing efforts. Work as part of a Government team to validate and verify design specifications, document and analyze requirements, review and critique system verification plan / procedures, and analyze system performance vs. requirements and user needs.\nInteract closely with multiple stakeholders and system and software engineers to arrive at a consensus on the design, development, and test phases of the program. Present analysis, propose technical solutions, model and measure performance, and validate results.\nReview software architectures and designs of applications within distributed computing networks, data networks, network simulation, and tactical networks. Perform vulnerability assessment of computer networks and satellite ground stations.\nIdentify and coordinate technical work performed for sponsor at APL Laurel location.\nParticipate as a member of the team to evaluate contractors' proposals for the system, and then provide contractor oversight to ensure the developed system meets user needs while mitigating program risks. Periodically brief APL management and sponsors on implementation and progress.\nYou meet our minimum qualifications for the job if you...\nA BS in Aerospace Engineering, Electrical Engineering, or Computer Science related disciplines.\n3 years of strong software systems engineering and software development experience\nDemonstrated understanding of software development, understanding of communication networks, and overall system vulnerability.\nDemonstrated strong analytical and problem solving skills with understanding of space systems.\nDemonstrated experience in software and network system engineering methodologies, principles, and concepts to solve systems related challenges.\nDemonstrated ability to work in a dynamic environment that includes working with changing needs and requirements.\nDemonstrated excellent interpersonal skills, be able to work independently, work as a team player, and work closely with sponsors.\nDemonstrated outstanding written and oral communication skills and good organizational skills.\nThe ability to travel occasionally.\nAre able to obtain a final Top Secret level security clearance by your start date and can ultimately obtain a TS/SCI level clearance. If selected, you will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.\nYou'll go above and beyond our minimum requirements if you...\nAn MS in Aerospace Engineering, Electrical Engineering, or Computer Science related disciplines.\n5 years of strong software systems engineering and software development experience with emphasis on software interaction with satellite ground systems, cybersecurity, and software requirements and definition.\nExperience with current Air Force satellite ground networks, DoDAF, DoD 5000, and model based systems engineering (MBSE).\nExperience in protecting against cyber intrusion techniques.\nAn active TS/SCI security clearance. If selected, you will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirement includes U.S. citizenship.\nWhy work at APL?\n\nThe Johns Hopkins University Applied Physics Laboratory (APL) brings world-class expertise to our nation’s most critical defense, security, space and science challenges. While we are dedicated to solving complex challenges and pioneering new technologies, what makes us truly outstanding is our culture. We offer a vibrant, welcoming atmosphere where you can bring your authentic self to work, continue to grow, and build strong connections with inspiring teammates.\nAt APL, we celebrate our differences and encourage creativity and bold, new ideas. Our employees enjoy generous benefits, including a robust education assistance program, unparalleled retirement contributions, and a healthy work/life balance. APL’s campus is located in the Baltimore-Washington metro area. Learn more about our career opportunities atwww.jhuapl.edu/careers.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Application Developer III", "Company": "CBTS TECHNOLOGY SOLUTIONS LLC", "Location": "Cincinnati, OH", "Detail Info": {"Description": "Employer\nCBTS Technology Solutions LLC d/b/a CBTS\nTitle:\nApplication Developer III\nWorksite Location:\nThis position reports to the Cincinnati, Ohio, office but requires that the employee be willing to relocate to assigned worksites at various unanticipated locations throughout the U.S. and reside within commuting distance of the current assigned worksite.\nDuties:\nCBTS Technology Solutions LLC d/b/a CBTS seeks Application Developer III to perform development tasks for designated IT projects and applications including but not limited to Web-based application development, orchestration, automation, database design and development and custom application development. The position may also be responsible for maintaining critical operational application systems that support the business or business customers and work incidents to resolution.\nRequirements:\nBachelor’s degree in computer science, computer information systems, or related field; 4 years of experience in the following: analysis, design, development, support, unit & integration testing of software applications; remediating applications- and server-related vulnerabilities and applying server patches; Linux or Windows server 20XX environments; C#, HTML/HTML5, CSS, Microsoft SQL Server, GIT, Jira, SQL, PL/SQ, VB6, UNIX Shell Script, VB Script, Java Script, and object oriented programming concepts; 2 years of experience working in an agile environment.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Sr. Software Developer", "Company": "Sally Beauty", "Location": "Denton, TX", "Detail Info": {"Description": "Overview\nNestled conveniently in North Texas in the vibrant city of Denton is the corporate headquarters of Sally Beauty Holdings, the world’s largest wholesale and retail distributor of beauty supplies.  We are inviting applications for our Sr. Software Developer.\n“At Sally Beauty Holdings, we find beauty in diversity.  Our inclusivity and self-expression are what fuel our innovation and growth. You are welcome here, and you can thrive here. We find beauty in YOU. Join us.”\nAs a Sr. Software (POS) Developer, you are responsible for the creation of all point of sale and payment related code for our stores. You will ensure all development/design efforts are in full compliance with corporate policies, procedures and security standard are met for sensitive customer data. Partnering with cross functional teams across various IT departments including, QA, Sales Audit, infrastructure, network, information security, project management and help desk to develop project estimates, timelines, technical and business requirements will be critical to your role. Ability to participate with on-call after hour support as a critical incident manager. Review, analysis, design, coding, testing and debugging of computer software solutions that meet requirements of company business applications. Works with end users, Third Parties, other IT staff and management to meet these requirements.\nResponsibilities\nWrites new code or modifies existing code to meet requirements of company business applications. Tests or Debugs his/her work to ensure that the functional requirements are met and that completed work is of high quality. Follows company development standards which are particular to their team.\nProvides production support in the form of troubleshooting problems, break fixes, adhoc data mining or other unspecified activities as directed by management. May be on call for afterhours support.\nPerforms review, analysis and design on new assignments identifying opportunities and challenges that may be signification to the successful completion of the assignment.\nComplies with existing documentation requirements required for the Software Development Life Cycle (SDLC). Complies with Payment Card Industry (PCI) requirements as required.\nLead IT vendor and internal partners in the delivery of retail solutions. Lead technical meetings providing updated status on deliverables.\nProcure accurate and timely information from the POS up to the Business Intelligence applications.\nDesign, implement and deliver reports for the leadership.\nHelp design, adapt, test and implement Payment Terminal solutions.\nParticipate in the release management of different IT platforms, including the installation and monitoring of production releases.\nSupport the continuous evolution of retail technology solutions through effective communication across the organization, proactively identifying areas of innovation and improvement.\nEnsure business requirements are met and technical integration is achieved for retail IT solutions.\nProvide production and lower environments support as directed by management.\nPartner with the QA team in integration/system/performance testing in order to ensure high quality solution releases for production.\nCollaborate with the support team and lead problem solving activities for production incidents.\nCoordinate solution development activities with Project Managers.\nCode Repository Management and Technical Design Definition for Change Control\nQualifications\nBachelor's degree in Computer Science or Computer Information Systems with 8+ years of relevant programming skills.\nPrevious experience with Azure Hosting and Cloud Technology.\nMust have Xstore Oracle POS technical development experience and deep foundational Xstore framework knowledge of the Oracle POS architecture and Software Suite Xcenter, Customer Engagement, Order Broker, Weblogic, Oracle Linux DB\nPrevious Xstore Upgrade Experience is required\nMust have experience integrating with EFT Link to payment system providers\nExperience working with VeriFone, FiPay, VeriFone point is a plus\nMust have experience with an ETL, preferable Skillnet’s Store HUB\nMust have experience with managing and utilizing BitBucket, Jenkins, and Eclipse\nExperience with  Biztalk, SCCM, BI, MQ\n5-8 years’ experience with Java Python, Oracle Java, JSON, SOAP, and REST API technologies.\nPossess knowledge and expertise in Oracle and SQL Server databases, comfortable with complex queries and PL/SQL language.\nPossess knowledge and expertise in different programming languages and operating systems. Knowledge of the different stages of the Software Development Life Cycle and industry best practices.\nProficiency in flow diagrams and documentation of software requirements.\nPossess knowledge and expertise in the retail business concepts and operations.\nStrong analytical and problem solving skills, and understand complex user requirements.\nStrong technical leadership, interpersonal communication skills with the ability to work under firm deadlines and within a rapidly changing environment.\nStrong verbal and written communication skills with an ability to adapt communications to different audiences.\nDemonstrated ability to support multiple concurrent projects and responsibilities.\nAbility to balance delivery speed with high quality solution deliverables.\nPreferred skills or knowledge: QuickBase, HTML & JavaScript, shell scripts, awk, Microsoft .NET.\nWe offer a competitive salary and outstanding benefits package that includes medical, dental, vision, life Insurance, paid vacation and sick days, paid holidays, tuition reimbursement and 401(k) with company match. In addition, associates of Sally Beauty may take advantage of our in house salon with complementary services, an onsite Sally Beauty Store with 30% merchandise discount and a gourmet cafe. \nQualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, or disability.\n#LI-VB1\nDIPOST", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Sally Beauty is the world's largest distributor and retailer of professional beauty products based on a store count of more than 3,700 stores in 13 countries. Sally Beauty stores operate throughout the United States and Puerto Rico, Canada, Colombia, Mexico, Peru, the United Kingdom, Belgium, Chile, France, Ireland, the Netherlands, Spain and Germany. Sally Beauty stores service both retail consumers and salon professionals by offering up to 10,000 products for hair, skin, and nails through professional lines such as Clairol, L'Oreal, Wella and Conair, as well as an extensive selection of proprietary merchandise.", "Profile": "https://www.monster.com/company/profiles/sally-beauty", "Website": "http://www.sallybeauty.com/", "Industry": "Retail", "Headquarters": "US, Denton, Texas", "Founded": "1964", "Social Networks": "instagram", "facebook": "twitter", "Company Size": "10,000 employees or more"}}, {"Job": "Assoc. Application Developer", "Company": "ADP Technology Services, Inc.", "Location": "Alpharetta, GA", "Detail Info": {"Description": "IT: ADP Technology Services, Inc. seeks an Assoc. Application Developer at our Alpharetta, GA loc to ptcpt in the SDLC, incl planning, constructions, testing, reviews, & demonstrations. Bach’s deg. in Comp. Sci., Comp. Engg., Info. Sys. or a rel. field + 4 yrs of rel. exp. Alternatively, ADP will accept a master’s deg. + 2 yrs. rel. exp. 2 yrs. of exp. must incl.: C#; .NET; CA Service Desk; Python; Restful & SOAP-based web services, incl JSON & XML; Java; Object-oriented analysis & design; SQL Database; Agile dvlpt; Source control including BitBucket; & Automation tools, incl Ansible or eTower. To apply, please respond to req. 197762 at http://jobs.adp.com. Alternatively, applicants may mail their resume to the following address referencing req. 197762: Employment Practices, 1 ADP Blvd., MS 248, Roseland, NJ 07068.", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Entry Level Software Developer, June 2021 [Cleveland or Akron, OH]", "Company": "Cohen & Company", "Location": "Cleveland, OH", "Detail Info": {"Description": "At Cohen & Company, our purpose is to engage, teach, inspire and improve lives through the power of knowledge and trust. We value great people, teamwork, a competitive spirit and courage, and the ability to adapt and remain optimistic.\nFueled by our purpose and principles, Cohen & Company offers comprehensive accounting, tax and consulting services to clients throughout the U.S. and worldwide. We serve a broad range of clients, from dynamic, privately held companies and their owners; to larger Fortune 1000 multinational and institutional enterprises; to high-net-worth individuals, trusts and foundations. We also have deep expertise in the investment industry serving public and private funds, investment advisors and fund service providers. Recognized as the 5th fastest growing accounting firm in the country, Cohen & Company is rooted in technical excellence and is driven every day to listen, engage and deliver sustainable value since our founding in 1977. Today, the firm has more than 650 associates throughout Illinois, Maryland, Michigan, New York, Ohio, Pennsylvania and Wisconsin. Member PCAOB.\nWe are excited for the future and our continued growth! Our Technology Services team is again seeking talented individuals in the role of Software Developer. This position will reside in our Ohio locations: Cleveland or Akron. There will be some travel to other office locations or for training (< 5%). This is a perfect opportunity for someone who is graduating in May of 2021! We’re looking for someone who can start with us in the June of 2021 timeframe!\nThe Software Developer will be a member of the Development Services team building tools to support the firm and our clients. Using an agile framework, the ideal candidate will work closely with teammates within Technology Services as well as other team members from across the company to refine existing products and bring new products and services to market. This covers all areas of the software development lifecycle including requirement analysis, design, implementation (coding), integration, testing, deployment, and maintenance.\nThe Software Developer position is ideal for a candidate new in their software development career. We are looking for candidates that are eager to learn and who have a desire to be part of a team. We are a collaborative team that is excited to help the right candidate grow their skills as we build software and solutions that assist our firm and our clients.\nResponsibilities\nAccountable for all parts of the software development lifecycle for their projects\nDesign, develop, document, and implement web and mobile applications\nDocument, maintain, support, and extend existing web applications\nResearch and recommend technical solutions to fit business needs\nActively participate in team activities and knowledge sharing, including scrum ceremonies\nActively participate in definition and refinement of team processes and activities\nWork collaboratively and effectively with all members of the team (PO, BA, QA, Developer)\nCollaborate with other Technology Services team members and key business stakeholders to achieve business objectives\nCore Competencies\nWeb Development Technologies\nExperience with one or more of the following technologies or similar\nVue.js or similar JavaScript framework (Angular/React)\nNode.js\nTypescript\nC#/.Net\nRDBMS development experience\nSQL\nExperience with Other Tools/Technologies a plus\nREST API’s\nVS Code\nVisual Studio or similar (Eclipse/IntelliJ)\nGit\nAzure DevOps or similar (Jira/Rally)\nPython\nEducation and Experience Requirements\nBachelor’s Degree in Computer Science, Computer Engineering, or related field\nGPA: 3.2 or higher\n0-2 years of development experience\nStart Date: June of 2021\nQualifications\nKeen sense of creative thinking, attention to detail and problem solving\nEager to learn and driven to increase their skills in all aspects of software development\nSelf-motivated with the ability to complete tasks within projects in a timely manner\nStrong analytical ability, true problem solver\nAbility to take ownership of tasks within projects and see them through to completion\nStrong communication skills\nAbility to communicate well across the organization by:\nCommunicating work progress and issues within an agile team\nCommunicating pros and cons of technical solutions within the development team\nCan articulate business needs and translate them into technology solutions\nLearn more about Cohen & Company at www.cohencpa.com and www.cohencpa.jobs.\nWe are an equal opportunity employer and value diversity of thought and background to build an inclusive and energized culture and better meet the needs of our clients.\nClick on the link below to apply:", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": {"Description": "Cohen & Company was founded in 1977 on the belief that there had to be a better way to help businesses succeed. Now ranked as one of the top accounting, tax and consulting firms in the country, our more than 400 team members serve entrepreneurs; private companies in a variety of industries; and registered and non-registered funds in the investment industry. The firm remains rooted in technical excellence, and is a member of the American Institute of Certified Public Accountants (AICPA) and registered with the Public Company Accounting Oversight Board (PCAOB). Cohen & Company continues to experience consistent growth and serves clients throughout the U.S. from offices in Ohio, Michigan, New York, Pennsylvania and Wisconsin. Learn more at cohencpa.com.", "Profile": "https://www.monster.com/company/profiles/cohen--company", "Website": "http://www.cohencpa.com/", "Industry": "Accounting and Auditing Services", "Headquarters": "US, Cleveland, Ohio", "Founded": "1977", "Company Size": "100 to 499 employees"}}, {"Job": "Senior Software Development Engineer", "Company": "Amazon.com Services LLC", "Location": "Jamaica, NY", "Detail Info": {"Description": "Cube Forecasting owns forecasting and planning of Amazon's global Fulfillment Center Capacity: we decide what, when, where, and how much space we will need and where to build to meet Amazon's business goals and to make our customers happy. We do this for millions of items, for hundreds of product lines worth billions of dollars of inventory world-wide.\n\nOur systems are built entirely in-house, and are on the cutting edge in automated large scale supply chain planning and optimization systems. Cube Forecasting fosters new game-changing ideas that we are continuously improving, resulting in sophisticated, intelligent and self-learning models. Cube Forecasting is unique in that we're simultaneously developing the science of supply chain planning and solving some of the toughest computational challenges at Amazon. Unlike many companies who buy existing off-the-shelf planning systems, Cube Forecasting is responsible for studying, designing, and building systems to suit Amazon's needs.\nThis position is for a lead on the team that creates and develops innovative solutions for the most challenging use cases confronting capacity planning today. This team owns the systems which are critical for managing capacity in Amazon’s network for retail customers to purchase on Amazon.com. These systems cover a broad range of solutions which includes front-ends, workflows, advanced mathematical models, data platform built using latest technology frameworks and AWS.\n\nThis opportunity is perfect for highly motivated and talented software engineers who want to design and architect systems, expand their technical depth and breadth while defining and driving key aspects of the customer experience on Amazon.com.\nTo learn more, watch this amazing video about Supply Chain Optimization Technologies (SCOT) at Amazon: http://bit.ly/amazon-scot\n\nBASIC QUALIFICATIONS\n· 4+ years of professional software development experience\n· 3+ years of programming experience with at least one modern language such as Java, C++, or C# including object-oriented design\n· 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems\n· Bachelor's degree in Computer Science or 8+ years of equivalent professional or military experience\nPREFERRED QUALIFICATIONS\n· Master of Science in Computer Science or related engineering field\n· Expertise in Statistics\n· Familiarity with , Pandas, and AWS services\n· Experience developing software in an agile environment\n· Experience on designing large scale distributed system\n· Strong problem-solving and data analytical skills\n· Great communication skills\nBy submitting your application here, you can apply once to be considered for multiple Software Engineer openings across various Amazon teams. If you are successful in passing through the initial application review and assessment, you will be asked to submit your career and personal preferences so that our dedicated recruiters can match you to the right role based on these preferences.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}, {"Job": "Software Developer", "Company": "SOLOMONS INTERNATIONAL LLC", "Location": "Lansdale, PA", "Detail Info": {"Description": "Software Developer Lansdale, PA Design, Develop, Test, Deploy and Document all phases of SDLC using C#, SQL Server, .Net Framework, ASP.Net, MVC, ADO.NET, LINQ to SQL, WCF, XML, Javascript, jQuery, AJAX, Must be willing to travel & reloc to unanticipated client locations throughout the US. Reqs BS in Comp Sci, Eng or rel w/ 2 yrs exp. Mail resumes to Solomons International LLC, Lansdale Business Centre, Suite #135, 650 North Cannon Avenue, Lansdale PA-19446", "Requirements": "SOME REQUIREMENTS TEXT", "Skills": "SOME SKILLS TEXT"}, "Company Info": "None"}]